{"id":1781,"date":"2020-10-01T11:35:05","date_gmt":"2020-10-01T11:35:05","guid":{"rendered":"https:\/\/CC9911F5-9499-4D35-AD19-C0DB4410BE1C"},"modified":"2024-10-29T11:10:16","modified_gmt":"2024-10-29T11:10:16","slug":"top-5-underestimated-defi-apps","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/","title":{"rendered":"Top 5 Underestimated DeFi Protocols With Great Potential"},"content":{"rendered":"\n<p>There is no need to say that DeFi market is gaining more and more attention every day. Unfortunately, many of the new DeFi protocols still are not well-known, but in Blaize we want to change it and guide you through the best DeFi apps that are grossly underrated, so far.<\/p>\n\n\n\n<p>As much as it develops and the number of users grows, it starts to seek new ways of money making and easier solutions to implement thus. The earlier Compound protocol is good, yet new players, as yEarn for instance, made a truly revolutionary step in DeFi apps sector.&nbsp;<\/p>\n\n\n\n<p>On this list we are going to look through completely new DeFi protocols, which market can definitely benefit from. Read more about newborn and still not well-know DeFi market actors below.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"630\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/05\/0nzS4rJNbPuzILY3Q-2.png\" alt=\"\" class=\"wp-image-33157\"\/><\/figure>\n\n\n\n<h2 class=\"wp-block-heading\">Uma <\/h2>\n\n\n\n<p><a href=\"https:\/\/umaproject.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Uma<\/a> stays for Universal Market Access and is a decentralized financial Ethereum based platform which makes financial markets worldwide accessible. Uma gives its users the ability to diversify funds without unnecessary interactions and third parties involvement.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\">Uma is a decentralized financial platform which makes financial markets worldwide accessible<\/p>\n\n\n\n<p>The security and success of a system are guaranteed by two main mechanisms: the first one is a decentralized and secured oracle strengthened by DMV (Data Verification Mechanism). In order to calculate a fair price of the Index, oracles gather the information about liquidity directly from the stocks and then translate it automatically to the blockchain. The second one is a smart contract based priceless financial mechanism. This type of contract is more secure and stable because it’s backed only by economic incentives.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1659\" height=\"749\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/uma.png\" alt=\"uma - defi app\" class=\"wp-image-2647\" srcset=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/uma.png 1659w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/uma-1536x693.png 1536w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/uma-1568x708.png 1568w\" sizes=\"(max-width: 1659px) 100vw, 1659px\" \/><figcaption><em>Uma Protocol<\/em> <a href=\"https:\/\/github.com\/UMAprotocol\/whitepaper\/blob\/master\/README.md\">GitHub<\/a> <\/figcaption><\/figure>\n\n\n\n<p>Uma has three synthetik tokens, and the main one is USStoks which is ERC20 token represented by Dai. Each USStocks token is equal to $1 of US Stock Index Level. The index is calculated out of the list of 500 largest companies according to NASDAQ or NYSE. Therefore, using UMA enables any user to create such kind of financial contract and attain the global financial market.&nbsp;<\/p>\n\n\n\n<p>Moreover, Uma has announced the release of yield dollar (yUSD) &#8211; synthetic token which allows users to gain interest thanks to its special features. The yUSD is a fixed-rate and expirable loan, equal to $1 at the final day of payoff. Due to the difference between initial and final trade, users can get up to 23% of income which enables the possibility of liquidity farming &#8211; one of the coolest DeFi apps feature &#8211; for UMA’s users.&nbsp;<\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/opinion\/top-10-blockchain-development-companies-for-2023\/\">Top 10 Blockchain Development Companies<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Opyn&nbsp;<\/h2>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\">Opyn Protocol enables risks and protection management for ETH holders <\/p>\n\n\n\n<p><a href=\"https:\/\/opyn.co\/#\/\">Opyn<\/a> is a most undervalued DeFi protocol which provides risks and protection management for ETH holders. Users are also able to protect their Compound deposits from financial and technical threats. Opyn uses Ethereum based Convexity Protocol in order to give its users the possibility of making put and call options.<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1605\" height=\"886\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/opyn.png\" alt=\"opyn - defi dapp security protocol\" class=\"wp-image-2648\" srcset=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/opyn.png 1605w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/opyn-1536x848.png 1536w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/opyn-1568x866.png 1568w\" sizes=\"(max-width: 1605px) 100vw, 1605px\" \/><\/figure>\n\n\n\n<p>Thanks to the blockchain technology, Opyn is fully trustless and non-custodial, which allows making deals without any claims’ validations by third parties. The ability to insure assets is extremely useful, especially in case Compound or Maker low or lose its collateral value. If such happens, Opyn users simply exercise their put options and get the insured coverage.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Thinking of creating your own decentralized finance project? Find some tips and useful recommendations in our article on <a href=\"https:\/\/blaize.tech\/article-type\/how-to-build-a-successful-defi-project\/\" target=\"_blank\" rel=\"noreferrer noopener\">How to Build a Successful DeFi startup<\/a><\/strong><\/p>\n\n\n\n<p>Moreover, usage of Convexity Protocol allows users to earn premiums from providing their liquidity (in ETH) to the vault, then creating put options and selling them to other users. In case nothing happens and the option expires, the seller gets back its collateral and the premium from option selling on top of it (put options’ addition is also available for Compound and Balancer, as well). Therefore, Opyn protocol does not only secure users’ assets, yet gives the possibility to earn additional profit out of it.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Zapper.fi&nbsp;<\/h2>\n\n\n\n<p><a href=\"https:\/\/zapper.fi\/\" target=\"_blank\" rel=\"noreferrer noopener\">Zapper<\/a> is a universal platform for managing different DeFi projects’ options. With the help of Zapper users can easily manage DeFi assets or deploy capital within 18 partnering decentralized finance platforms. Zapper works as a dashboard which combines features from supported platforms in one place and thus make the user experience easier, faster and cost-efficient.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1415\" height=\"738\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/zapper.jpg\" alt=\"zapper.fi defi dapp\" class=\"wp-image-2649\"\/><\/figure>\n\n\n\n<p>Due to usage of smart contract algorithms, Zapper allows users to deploy capital simply while transferring tokens (like ETH) to a certain chosen platform within a couple clics. Users are able to “share” capital between different DeFi pools, and shift it to more profitable investment opportunities, if needed. <\/p>\n\n\n\n<p>Furthermore, with the help of Pool Pipes feature, users can invest and get the reward (ROI) while “transporting” their liquidity to other platforms like Balancer, Curve, or Uniswap. Another unique feature of Zapper is the introduction of Synthetix Liquidity Incentive pool, which allows to stake and unstake UNI tokens and get the rewards. <\/p>\n\n\n\n<p>As you can see, Zapper app combines a very useful and rich kit of features in one place.  Zapper interface can be called one of the richest on the current market and cannot surely remain as one of the underestimated DeFi apps.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\"><em><strong>Thinking of building your own DeFi app, but now sure where to start?<\/strong> <a href=\"https:\/\/blaize.tech\/#contacts\">Contact us<\/a> and schedule a <strong>free <a href=\"https:\/\/blaize.tech\/consulting\/\">idea validation<\/a> audit <\/strong>via couple of clicks. <\/em><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Atomica<\/h2>\n\n\n\n<p><a href=\"https:\/\/atomica.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Atomica<\/a> is built with the aim to protect its users from crypto-market risks. While enabling risk mitigation and risk transfer possibilities, users are able to buy, sell and pool different DeFi risks.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\">Atomica helps to mitigate risks for DeFi users <\/p>\n\n\n\n<p>Grasefull Unwinding feature enable users to mitigate the risks and get compensation in case of fraud, oracles failure, hacks or asset loss. It is possible due to the work of smart contract, which takes a part of a collateral, sells it in exchange for DAI with the proceeds, which are used then in order to pay the arrears. This happens automatically and continuously until the loan will be covered in full.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1280\" height=\"800\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/photo_2020-06-03_12-40-58-1.jpg\" alt=\"Atomica Protocol how it works\" class=\"wp-image-2651\"\/><figcaption><em>The main<\/em> <a href=\"https:\/\/atomica.org\/\">Atomica<\/a> <em>Liquidation Markets Parties<\/em> <\/figcaption><\/figure>\n\n\n\n<p>Another feature provided by Atomica gives the ability to earn from the collateral liquidations, buyers’ premiums or fees for idle capital and called Atomica Liquidation Market (ALM) platform. <\/p>\n\n\n\n<p>ALM system consists of three main parts: the first one is the pool, which accumulates DAI liquidity. The second one is Keeper Adapter, which is responsible for bringing the profit to the user as soon as the auction is won. The third part is called Risk Oracle and takes advantage of vaults monitoring, checking, and starting the auction. <\/p>\n\n\n\n<p>Such complex features and new mechanisms make Atomica a very attractive player on the DeFi market.&nbsp;In <a href=\"https:\/\/blaize.tech\/decentralized-application\/\" target=\"_blank\" rel=\"noreferrer noopener\">Blaize<\/a>, we are very fascinated about Atomica rich and thoughtful mechanism of money securing. Therefore, we do not want it to be listed among  underestimated DeFi apps on the market. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">yEarn&nbsp;<\/h2>\n\n\n\n<p><a href=\"https:\/\/yearn.finance\/\">yEarn<\/a> is also quite the most underrated young and open finance protocol in DeFi, which lets its users to benefit from so-called yield farming. yEarn has its own token – YFI which made a true breakthrough in the DeFi sector. Despite its creator’s claiming, that the YFI tokens are valueless, it’s usage and amount of transactions made with it grows every second.<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\">yEarn is a DeFi app which optimize token lending through different services like AAVE or Compound <\/p>\n\n\n\n<p>The mechanism of YFI is considered as one of the most complex on the market. Users put their liquidity in one of supported pools in return for YFI tokens. The amount of YFI in the pool is limited to 10000 YFI in each pool and remains so until the on-chain voting appears and governance adjusts the inflation. The mechanism of yEarn protocol moves chosen tokens across different lending pools (using Compound, dYdx or Aave) in order to maximize the interest rate. <\/p>\n\n\n\n<p>Moreover, thanks to compatibility with Curve, tokens continue to earn interest while in one of its pools, which enable users to multiply their capital even more (users can experience quite similar scheme of work, while using Zapper.fi instead of Curve).&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-primary-red-background-color has-text-color has-background\">Read more about Curve and other DeFi apps in our previous article Top Successful DeFi Startups. <\/p>\n\n\n\n<p>Although yEarn gives its users the ability to “work” their money in a very effective and profitable way, it says, that the DeFi protocol is still in its beta and the users should use it at their own risk, as far as some bugs in the smart contract may appear.<\/p>\n\n\n\n<p>Yet, in spite of the relatively high possibility of loss and quite risky environment, the yEarn protocol along with YFI token gather more and more attention around it on decentralized market, which makes the mechanism very interesting and worth to try.&nbsp;<\/p>\n\n\n\n<h2 class=\"mb-0 has-white-color has-text-color has-background wp-block-heading\" style=\"background-color:#8f8f8f\">Info Update<\/h2>\n\n\n\n<p class=\"has-white-color has-text-color has-background\" style=\"background-color:#8f8f8f\">The DeFi market and its main players are changing lighting-fast. The yEarn was not an exception. Right after our blog post release, the protocol has gathered truly a lot of attention and the price for the token has been increasing and breaking its records every day. In spite crypto and DeFi tokens high volatility and drastic market ups and downs, YFI token still remain its high value, and now cost around $24000 per one!<\/p>\n\n\n\n<figure class=\"wp-block-image size-large mb-0\"><img loading=\"lazy\" decoding=\"async\" width=\"1148\" height=\"583\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/yearn.png\" alt=\"yearn token capitalization\" class=\"wp-image-2652\"\/><figcaption><a href=\"https:\/\/www.coingecko.com\/en\">CoinGeco<\/a> <em>Coins Review by market Capitalization, 30.09.2020<\/em><\/figcaption><\/figure>\n\n\n\n<p class=\"has-white-color has-text-color has-background\" style=\"background-color:#8f8f8f\">It is worth mentioning that the price for a single yEarn token could reach even $40000 during last month! Though, once called underestimated yEarn will not surely be named so today. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion<\/h2>\n\n\n\n<p>Market tendency shows that accumulation of crypto assets is not enough, and users want their money to work. Decentralized finance has broadened the scope and new mechanism for so-called yield or liquidity farming seems to be very prosperous. As we know, big risks come along with high profit and users should keep this in mind and be aware of the consequences.&nbsp;<\/p>\n\n\n\n<p>Due to a huge DeFi boom, a lot of new decentralized finance protocols were raised in the 2Q and 3Q of 2022. Though many of them have a big potential, they are still not known so considered as underestimated DeFi apps.<\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\"><em><strong>Ready to create your own DeFi app but not sure where to start?<\/strong> <a rel=\"noreferrer noopener\" href=\"https:\/\/blaize.tech\/#contacts\" target=\"_blank\">Contact us<\/a> and schedule a <strong>free <a rel=\"noreferrer noopener\" href=\"https:\/\/blaize.tech\/consulting\/\" target=\"_blank\">idea validation<\/a> audit <\/strong>via couple clicks.<\/em><\/p>\n\n\n\n<p>The number of assets located in DeFi&nbsp;apps such as Uniswap is growing exponentially and requires new solutions to be developed. Security issue is not an exception for this. Though, if crypto world had not felt the extreme necessity to insure the assets before, March fluctuations and market augmentation have shown the high necessity of asset protection or diversification. <\/p>\n\n\n\n<p>The traditional fiats have their money secured by Central banks or governments that cryptocurrencies cannot have. That is why the development of different DeFi apps which allows securing of crypto liquidity does not have to remain underestimated and unnoticed.&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>There is no need to say that DeFi market is gaining more and more attention<a href=\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":342,"featured_media":1786,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[285,452,288,278],"tags":[306,305],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top 5 Underrated DeFi Apps &amp; Protocols - Blaize<\/title>\n<meta name=\"description\" content=\"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top 5 Underrated DeFi Apps &amp; Protocols - Blaize\" \/>\n<meta property=\"og:description\" content=\"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-01T11:35:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:16+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/08\/DeFi-2.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Sergey Onyshchenko\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@S_Onishchenko\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sergey Onyshchenko\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\",\"url\":\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\",\"name\":\"Top 5 Underrated DeFi Apps & Protocols - Blaize\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2020-10-01T11:35:05+00:00\",\"dateModified\":\"2024-10-29T11:10:16+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\"},\"description\":\"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Top 5 Underestimated DeFi Protocols With Great Potential\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\",\"name\":\"Sergey Onyshchenko\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"caption\":\"Sergey Onyshchenko\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/sergeyonishenko\/\",\"https:\/\/twitter.com\/S_Onishchenko\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top 5 Underrated DeFi Apps & Protocols - Blaize","description":"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/","og_locale":"en_US","og_type":"article","og_title":"Top 5 Underrated DeFi Apps & Protocols - Blaize","og_description":"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.","og_url":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/","og_site_name":"Blaize","article_published_time":"2020-10-01T11:35:05+00:00","article_modified_time":"2024-10-29T11:10:16+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/08\/DeFi-2.jpg","type":"image\/jpeg"}],"author":"Sergey Onyshchenko","twitter_card":"summary_large_image","twitter_creator":"@S_Onishchenko","twitter_misc":{"Written by":"Sergey Onyshchenko","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/","url":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/","name":"Top 5 Underrated DeFi Apps & Protocols - Blaize","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2020-10-01T11:35:05+00:00","dateModified":"2024-10-29T11:10:16+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670"},"description":"Many new DeFi protocols are not well-known, but in Blaize, we want to change it and guide you through Top 5 underestimated DeFi apps, so far.","breadcrumb":{"@id":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/blog\/top-5-underestimated-defi-apps\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Top 5 Underestimated DeFi Protocols With Great Potential"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670","name":"Sergey Onyshchenko","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","caption":"Sergey Onyshchenko"},"sameAs":["https:\/\/www.linkedin.com\/in\/sergeyonishenko\/","https:\/\/twitter.com\/S_Onishchenko"]}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/1781"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/342"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=1781"}],"version-history":[{"count":29,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/1781\/revisions"}],"predecessor-version":[{"id":33158,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/1781\/revisions\/33158"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/1786"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=1781"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=1781"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=1781"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}