{"id":2311,"date":"2020-09-14T13:18:32","date_gmt":"2020-09-14T13:18:32","guid":{"rendered":"https:\/\/D63B7A1B-8501-4026-9084-82C28F7A4406"},"modified":"2024-10-29T11:10:18","modified_gmt":"2024-10-29T11:10:18","slug":"how-amm-works-technology-basics","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/","title":{"rendered":"How AMM-based DEX Works: Technology Basics"},"content":{"rendered":"\n<p>In this article we will explain how AMM technology works and show the difference between AMM exchange and traditional order book. You will also know some basics of technology to <a href=\"https:\/\/blaize.tech\/article-type\/how-to-build-a-successful-defi-project\/\">build your AMM-based DeFi solution<\/a> in future.<\/p>\n\n\n\n<p>The exchange has become a part of a traditional financial system a long time ago. Its mechanism of work is very well known, in a broad sense, an exchange is a market where sellers meet with buyers in order to make a transaction. The relationships on the exchange are supported by order books which are (electronic) lists of orders. <\/p>\n\n\n\n<p>This common mechanism has been successfully working until the crypto intervention. Along with the technology development and increase of locked amounts in crypto assets, holders started to seek new solutions. The automatic market maker mechanism had been known some years before that, but the creation of DEX became a huge step for its adaptation to the crypto market.&nbsp;<\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/analysis\/how-to-create-your-own-cryptocurrency-from-a-to-z\/\">How to create your own cryptocurrency<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Some of HISTORICAL BACKGROUND&nbsp;<\/h2>\n\n\n\n<p>The idea of so-called “on-chain market maker” was firstly described by Vitalik Buterin and explained as the idea of “<a href=\"https:\/\/vitalik.ca\/general\/2017\/06\/22\/marketmakers.html\" target=\"_blank\" rel=\"noreferrer noopener\">On Path Independence<\/a>”. It was further implemented in Bancor (V1) Protocol and introduced to the public in 2017. Yet, protocol gathered a lot of critics and doubts around it, so stayed kind of “behind the curtain” of the AMM fame. <\/p>\n\n\n\n<p>The first and probably still maintained, buzz around automated market maker and decentralized finance itself happened along with the <a href=\"https:\/\/uniswap.org\/\">Uniswap<\/a> release in 2018. It made a real breakthrough on the market because of a couple of features: fast and secured trading deals, earnings from liquidity, and decentralization of exchange itself.<\/p>\n\n\n\n<p>As long as Uniswap was aimed for token exchange, we experienced <a href=\"https:\/\/www.curve.fi\/\" target=\"_blank\" rel=\"noreferrer noopener\">Curve<\/a> invention in 2019, which enabled the decentralized and non-custodial exchange of <a href=\"https:\/\/blaize.tech\/article-type\/understanding-stablecoin\/\">stablecoins<\/a>. Curve protocol has been always compared to Uniswap model and has been named as its follower, which is not really true in nature. <em><strong>This difference will be further discussed in an article dedicated to the <a href=\"https:\/\/blaize.tech\/article-type\/amm-types-differentiations\/\" target=\"_blank\" rel=\"noreferrer noopener\">AMM types<\/a>.&nbsp;<\/strong><\/em><\/p>\n\n\n\n<p>Uniswap uses a so-called <strong>constant function market maker model which, as appeared, faces a few serious obstacles, for instance,<\/strong> front running. This contributed to the creation of other protocols like Balancer, Mooniswap or FairSwap, all in 2020, which led to the huge boom in dApps development and DeFi in particular. <\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\">New protocols aimed to solve the common problems classic AMM exchanges experiences and therefore use other, quasi-AMM models to perform continuous token curves. In this article, we are going to concentrate on the “traditional” Defi AMM model in order to understand the basics. If you want to know more about Balancer and <a href=\"https:\/\/blaize.tech\/article-type\/overview\/amm-solutions-to-impermanent-loss-and-front-running\/\">how to solve the front-running problem<\/a> check the pinned article.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Centralized vs decentralized exchanges&nbsp;<\/h2>\n\n\n\n<p><em><strong>Well, how decentralized exchanges are different from traditional ones, and why users want to stay away from such a simple and universally known centralized model? <\/strong><\/em><\/p>\n\n\n\n<p>First of all, a centralized exchange contains risks for traders. One of the main reasons is that the custodian of all assets and information about all transactions is one organization. Additionally, the exchange requires users to deposit funds in a wallet that is owned and operated by the exchange itself. Furthermore, it is easier for hackers to detect and attack vulnerabilities concentrated in one center, so in case of attack, the hacker can shut down the exchange and “go away” with all funds. Due to traditional order book usage, the work of centralized exchange is relatively slower and sometimes may lead to funds loss, in case of certain technical mistakes.&nbsp;<\/p>\n\n\n\n<p>In contrast, the order book of a decentralized exchange is stored on the blockchain. All processes connected with order placement, <a href=\"https:\/\/blaize.tech\/article-type\/how-to-conduct-a-smart-contract-security-audit-of-your-project-and-why-this-is-important\/\">smart contract security audit<\/a> and maintenance are under the smart contract power. If you were looking for a <strong><a href=\"https:\/\/blaize.tech\/smart-contracts\/\">smart contract audit company<\/a><\/strong>, you can contact us and get additional answers to your questions. IDEX is one of the well-known representatives of decentralized exchanges with traditional order book module. Yet, IDEX is rather should be called partially decentralized, because it uses a centralized order book which then sends the information to the smart contract on the blockchain. Hence, in order to get such a crucial decentralized environment, users can go to Dy\/dx which is an IDEX mate, but with a totally decentralized order book in it.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"alignleft size-full is-resized\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2022\/06\/create-AMM-based-DeFi.png\" alt=\"\" class=\"wp-image-7561\" width=\"371\" height=\"315\"\/><\/figure><\/div>\n\n\n\n<p><em><strong>So, why do we need an AMM model if DEXs are cool with the traditional order book practice? <\/strong><\/em><\/p>\n\n\n\n<p>Essentially, the work of order book lies in recording the buy\/sell offers and then matching traders with the same or similar requests, but in terms of blockchain, this has become the main problem of this system. These processes make the work costly and make work slow. That is why the introduction of an AMM in DEXes has brought crypto trading to a completely new level giving the ability to atomic trading or instant feedback loops. <\/p>\n\n\n\n<p>The main difference between those two approaches lies in the fact that while using the AMM-based DEX model, users do not need to wait for another trader to place a desirable offer. Automatic market maker creates an environment where the user trades with the smart contract within the chosen pool and then gets the requested tokens and happily leaves. The algorithm of the smart contracts dictates how the assets should be traded and therefore do the whole work by itself. What kind of magic they use to fulfill such will be further explained below.&nbsp;<\/p>\n\n\n\n<h3 class=\"has-text-align-center has-white-background-color has-background wp-block-heading\"><strong><em><span class=\"has-inline-color has-primary-red-color\">Thinking of creating your own AMM-based DeFi solution? Start DeFi development with Blaize by <a href=\"https:\/\/blaize.tech\/#contacts\" target=\"_blank\" rel=\"noreferrer noopener\">contacting our expert<\/a>!<\/span><\/em><\/strong><\/h3>\n\n\n\n<h2 class=\"wp-block-heading\">What is AMM (Automated Market Maker)?<\/h2>\n\n\n\n<p>If say a general definition of an AMM model in crypto, it would sound that AMM is an automatic actor whose work is defined by conditional rules of trade inserted into smart contracts. Yet in Blaize we do not follow a general definition, so let’s dive deeper into the math. The formula for let’s call the “traditional” automatic market maker model looks as follows:&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">X*Y=C&nbsp;<\/p>\n\n\n\n<p>where X and Y are reserves of certain (chosen) assets in the AMM pool, and C is an unchangeable constant. Due to the presence of such a constant, this model is also called a constant product market maker.<\/p>\n\n\n\n<p>The next important part of the AMM model is a pool where actually the whole process is going on. Yet, this does not mean that the provider should put in the same amount of each token. Tokens equality in this case should be calculated out of the market price and then translated to the relevant conditional number. Imagine you create an AMM pool with ETH and Dai in it, the price for those two differs considerably on the market (when 1 ETH = $100; 1 DAI=$1), so in order to make them “equal” we need to put, for instance, 10 ETH to 1000 Dai, then the overall cost of each will be 1000:<\/p>\n\n\n\n<p class=\"has-text-align-center\">$100 (ETH price) *10 = 1000&nbsp; &nbsp; and,&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">$1 (DAI price) *10 = 1000.&nbsp;<\/p>\n\n\n\n<p>In this case we can say they are supplied equally to the pool. So in terms of AMM pools, what you should pay attention to is the relation between two (chosen) tokens and its volatility on the market.<\/p>\n\n\n\n<p>Coming back to formula, now we can easily establish our constant value for this pool. So having ETH as X and Dai as Y we will get:&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">10 (ETH)*1000(DAI)= 10000<\/p>\n\n\n\n<p>If nothing happens, the user will see these stable values for each. Yet, what if something does happen, and somebody wants to get in and take 1 ETH, as an example. Then, the formula will change as follows:&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">(X-1)*(Y+(1*a+fee))=C1<\/p>\n\n\n\n<p class=\"has-text-align-center has-dark-gray-color has-text-color has-background\" style=\"background-color:#d6d6d6\">(10ETH &#8211; 1ETH)*(1000DAI + (1ETH*price + fee) = C1<\/p>\n\n\n\n<p>where <em>X <\/em>and <em>Y <\/em>are reserves of certain (ETH and Dai) assets, 1 is the desirable withdrawal number, <em>a <\/em>is the price of 1 ETH in DAI (1 ETH = 100 DAI)&nbsp; and <em>fee <\/em>is the amount the trader pays additionally to the DEX for the ability to fulfill such an operation. In this way, we see the constant has changed due to transaction fee, and will continuously change with every further trade. <\/p>\n\n\n\n<p><em><strong>But how can we say it is the “constant” if it actually changes? <\/strong><\/em><\/p>\n\n\n\n<p>The answer is, we can, as long as the product of <em>X*Y<\/em> is equal to <em>C<\/em>. Transaction fee does not dramatically influence the pool curve and varies each way thousands of times per day. In order to make a fair trade, AMM DEXs use the constant invariant equation to always balance assets in a pool, this happens thanks to the creation of a bonding curve.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>How to detect an accurate price? <\/strong><\/h2>\n\n\n\n<p>In its sharp explanation, we can say that if you want to sell a token, then the price will be equal to the number of tokens in the pool, but if you want to buy a token, the price will be as if you have already purchased one. There are two main options of how the user can use the curve. Assume there are 10 certain tokens in the pool and the price is 10 for each. You want to sell back 3 tokens.&nbsp;<\/p>\n\n\n\n<ol><li>In the common scenario, for selling them all at once you will get 3&#215;8=24 in return (because the price after your sell will be 8 already)&nbsp;<\/li><li>In a smarter scenario, you would pay out 1 token at a time, and then get 10+9+8=27 in return.&nbsp;<\/li><\/ol>\n\n\n\n<p>The only problem is the <strong>gas fee<\/strong> which is issued for each transaction, therefore the second option seemed reasonable only while dealing with bigger amounts of tokens and needs in-depth pre-calculation.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Where does the money come from ?&nbsp;<\/strong><\/h2>\n\n\n\n<p>One of the most important questions to ask is where exactly money comes from in all this. Well, the profit may come in two scenarios: while providing the liquidity and while fulfilling the trade.&nbsp;<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1026\" height=\"630\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2022\/06\/profit.png\" alt=\"building amm dex\" class=\"wp-image-7563\"\/><\/figure><\/div>\n\n\n\n<p>There are following types of actors participating in the process:&nbsp;<\/p>\n\n\n\n<ol><li><strong>Liquidity providers<\/strong> &#8211; users who want to supply their crypto assets into the pool and therefore make profit out of it;&nbsp;&nbsp;<\/li><li><strong>Traders <\/strong>&#8211; users who want to buy or sell certain type and amount of tokens;<\/li><li><strong>Arbitrageurs <\/strong>&#8211; actors who maintain the pool price in exchange for reward.<\/li><\/ol>\n\n\n\n<h2 class=\"wp-block-heading\">How do liquidity providers make profits?&nbsp;<\/h2>\n\n\n\n<p><em>Remember the “+fee” in the second formula? <\/em><strong><em>That is how. <\/em><\/strong><\/p>\n\n\n\n<p>For those, who want to supply their liquidity to the pool, DEX&#8217;s work is similar to traditional banking depositing. So you hold a certain amount of crypto (assume ETH) and you want your money “to work”, so you can “give” them to the chosen exchange (assume Uniswap) and therefore you become eligible to earn profit from your assets’ usage. <\/p>\n\n\n\n<p>In traditional AMM DEX it works as follows: liquidity provider A supplies (assumed) 1000 ETH to the ETH\/Dai pool, where (assumed) 9000 ETH have been provided already. Now the total amount of ETH in the pool is 10000 ETH (9000 ETH + 1000 ETH). So the A “share” in the pool will be 10% of the whole ETH pool. When any trade within the pool occurs, the trader pays a transaction fee which is then transferred to the liquidity providers as a reward. <\/p>\n\n\n\n<p>The fee is split between liquidity providers in accordance with their share percentage. Therefore, in the case of A, he will get a 10% reward from each transaction in the poll he supplied money to.&nbsp;Read: <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-to-prevent-liquidity-vampire-attacks-in-defi\/\">How to Prevent Vampire Attacks in DeFi<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How do arbitrageurs make profits?&nbsp;<\/h2>\n\n\n\n<p>Arbitrageurs are usually represented by bots that are aimed to catch the best deals, trade them to the pool and therefore maintain the balance of the curve (and token price). Using the previously mentioned equation we follow the same assumption and describe the trading process as follows:&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">(10-1)*(1000 + (1*a +fee)) = 10000<\/p>\n\n\n\n<p class=\"has-text-align-center\">assume (1*a) as X&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">9*(1000+X)=10000<\/p>\n\n\n\n<p class=\"has-text-align-center\">1000+X = 10000\/9&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center\">1000+X =1111.111….<\/p>\n\n\n\n<p class=\"has-text-align-center\">X = 1111-1000=111&nbsp;<\/p>\n\n\n\n<p>We can see that due to a trade fulfillment, the price of tokens in the pool has changed and the price of ETH increased to $111 (instead of $100). Yet, the normal price for ETH on the regular exchange (let’s assume CoinBase) still remains $100. When such happens, the arbitrageur buys&nbsp; ETH from CoinBase and sells it to the pool (still for $111). In this particular example, the profit of the arbitrageur will be $11 (and all this from a single transaction!!!).&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is the difference between arbitration and trading ?&nbsp;<\/h2>\n\n\n\n<p>Traders are basically retailers who want to exchange their crypto assets at a good price. In traditional AMM, traders have no additional information about general market prices and have to trade only at the price offered by the pool. Well, fulfilling the trade they do influence the pool price, but this does not make them arbitrageurs. <\/p>\n\n\n\n<p><strong><em>The main difference lies in the purpose of conducting such an action, wherein the case of trading the purpose is to get a certain needed asset in exchange for what the trader has in the pocket, while in the case of arbitrageur the main purpose is to buy low &#8211; sell high and make a profit out of it.<\/em><\/strong>&nbsp;<\/p>\n\n\n\n<p>Another interesting feature of an automated market maker is that despite the insolent behavior of arbitrageurs the system basically cannot exist without them. In case of lack of permanent token supply or buy flow, the curve will not maintain at the same level so will not create a pleasant exchange environment for traders. <\/p>\n\n\n\n<p>As a leading <strong><a href=\"https:\/\/blaize.tech\/for-startups\/\">blockchain consulting company<\/a><\/strong>, our team can help you understand these concepts better and advise on the best way to incorporate automated market makers into your trading platform.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Final thought <\/strong><\/h2>\n\n\n\n<p>An automatic market maker is a convenient resolution and very vulnerable mechanism at the same time. <\/p>\n\n\n\n<p>As one of the main issues with AMM DEXes is that their mechanisms are sensible to front running and pumping attacks. The paradox is, the easier to find the intrinsic value of a token, the harder it is to manipulate the system. Yet, gladly, there are already a few solutions on the DeFi DEX market that successfully solves these problems. We have discussed various types of resistance increasing in <a href=\"https:\/\/blaize.tech\/article-type\/overview\/amm-solutions-to-impermanent-loss-and-front-running\/\" target=\"_blank\" rel=\"noreferrer noopener\">Impermanent loss and Front-running solutions for the AMM DEX<\/a> article.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-primary-red-background-color has-text-color has-background\"><strong><em>Blaize team of DeFi developers has gathered extensive knowledge of the decentralized finance market and DeFi dApps development. If you are thinking of building AMM-based DeFi project similar to Uniswap, for example, do not hesitate to <a href=\"https:\/\/blaize.tech\/#contacts\" target=\"_blank\" rel=\"noreferrer noopener\">contact Blaize<\/a> for further discussion. <\/em><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Frequently Asked Questions<\/h2>\n\n\n\n<p><strong>What is an AMM in crypto?<\/strong><\/p>\n\n\n\n<p>An AMM stands for an Automated Market Maker, which is the underlying protocol that powers a decentralized exchange. It pools liquidity from users and prices the assets within the pool using algorithms.<\/p>\n\n\n\n<p><strong>How does an AMM work?<\/strong><\/p>\n\n\n\n<p>In a nutshell, an AMM allows digital assets to be bought and sold automatically at market price on a DEX, with no middlemen. This can happen with liquidity from a liquidity pool on an AMM, which prices the assets and enables the trade.<\/p>\n\n\n\n<p><strong>Is AMM the same as DEX?<\/strong><\/p>\n\n\n\n<p>No, AMM is a protocol that runs on liquidity pool-based DEXes, but it is not a feature inherent to all decentralized exchanges.<\/p>\n\n\n\n<p><strong>How does AMM determine the price?<\/strong><\/p>\n\n\n\n<p>The price of tokens is determined by a constant mathematical formula at the heart of an AMM.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In this article we will explain how AMM technology works and show the difference between<a href=\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":342,"featured_media":2316,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[287,285,452,278],"tags":[306,305],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Automated Market Maker (AMM) &amp; How it Works - Blaize<\/title>\n<meta name=\"description\" content=\"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Automated Market Maker (AMM) &amp; How it Works - Blaize\" \/>\n<meta property=\"og:description\" content=\"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2020-09-14T13:18:32+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:18+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/amm2.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Sergey Onyshchenko\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@S_Onishchenko\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sergey Onyshchenko\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"13 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\",\"url\":\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\",\"name\":\"Automated Market Maker (AMM) & How it Works - Blaize\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2020-09-14T13:18:32+00:00\",\"dateModified\":\"2024-10-29T11:10:18+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\"},\"description\":\"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How AMM-based DEX Works: Technology Basics\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\",\"name\":\"Sergey Onyshchenko\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"caption\":\"Sergey Onyshchenko\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/sergeyonishenko\/\",\"https:\/\/twitter.com\/S_Onishchenko\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Automated Market Maker (AMM) & How it Works - Blaize","description":"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/","og_locale":"en_US","og_type":"article","og_title":"Automated Market Maker (AMM) & How it Works - Blaize","og_description":"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.","og_url":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/","og_site_name":"Blaize","article_published_time":"2020-09-14T13:18:32+00:00","article_modified_time":"2024-10-29T11:10:18+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/09\/amm2.png","type":"image\/png"}],"author":"Sergey Onyshchenko","twitter_card":"summary_large_image","twitter_creator":"@S_Onishchenko","twitter_misc":{"Written by":"Sergey Onyshchenko","Est. reading time":"13 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/","url":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/","name":"Automated Market Maker (AMM) & How it Works - Blaize","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2020-09-14T13:18:32+00:00","dateModified":"2024-10-29T11:10:18+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670"},"description":"In this article, we explain how AMM technology works and also know some basics of technology to build your AMM-based DeFi solution in future.","breadcrumb":{"@id":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/blog\/how-amm-works-technology-basics\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"How AMM-based DEX Works: Technology Basics"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670","name":"Sergey Onyshchenko","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","caption":"Sergey Onyshchenko"},"sameAs":["https:\/\/www.linkedin.com\/in\/sergeyonishenko\/","https:\/\/twitter.com\/S_Onishchenko"]}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2311"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/342"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=2311"}],"version-history":[{"count":43,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2311\/revisions"}],"predecessor-version":[{"id":29027,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2311\/revisions\/29027"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/2316"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=2311"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=2311"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=2311"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}