{"id":2696,"date":"2020-10-05T07:55:30","date_gmt":"2020-10-05T07:55:30","guid":{"rendered":"https:\/\/E0AF8C5E-6B37-449F-9555-F3646E63FC05"},"modified":"2024-10-29T11:10:15","modified_gmt":"2024-10-29T11:10:15","slug":"top-startups-on-polkadot-that-will-rock-in-2021","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/top-startups-on-polkadot-that-will-rock-in-2021\/","title":{"rendered":"Top Projects on Polkadot that will rock in 2021"},"content":{"rendered":"\n<p>Polkadot unites the entire network of multiple blockchains into one decentralized ecosystem. While enabling a transparent, easy cross-chain communication and customization of blockchains it becomes a very powerful tool for <a href=\"https:\/\/blaize.tech\/for-enterprises\/\">building enterprise solutions<\/a> or projects on Polkadot.<\/p>\n\n\n\n<p>From this article, you will know the best projects on Polkadot and its reflection on today&#8217;s web3 environment. Acala, Moonbeam, Edgeware and Centrifuge took our attention these days.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is Polkadot ?&nbsp;<\/h2>\n\n\n\n<p><a href=\"https:\/\/polkadot.network\/\" target=\"_blank\" rel=\"noreferrer noopener\">Polkadot<\/a> connects multiple blockchains together in order to ease and enhance decentralized apps building. Together with all connected parachains it creates a scalable multichain.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>“Polkadot is a sharded blockchain, meaning it connects several chains together in a single network, allowing them to process transactions in parallel and exchange data between chains with security guarantees”.<\/em><\/p>\n<cite><a href=\"https:\/\/polkadot.network\/Polkadot-lightpaper.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Polkadot Litepaper<\/a><\/cite><\/blockquote>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"800\" height=\"269\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/preview.png\" alt=\"projects on Polkadot \" class=\"wp-image-2719\"\/><figcaption class=\"wp-element-caption\"><em>Potential parachains connected to <a rel=\"noreferrer noopener\" href=\"https:\/\/polkadot.network\/polkadot-parachain-slots\/\" target=\"_blank\">Polkadot<\/a> ecosystem<\/em><\/figcaption><\/figure><\/div>\n\n\n<h3 class=\"wp-block-heading\">The problem&nbsp;<\/h3>\n\n\n\n<p>Until its release, protocol limitations of most blockchains made its wider adoption impractical and difficult. It caused the main problem of today&#8217;s blockchain ecosystems &#8211; lack of interoperability between different protocols. Moreover, for sufficient and scalable work, blockchains need constant upgrades and enhancement. This process goes much slower than in the case of app or browser updates and usually requires network forks. Such difficulties created a “communication” problem in terms of blockchains cooperation.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">The solution&nbsp;<\/h3>\n\n\n\n<p>Polkadot resolves this problem by enabling different blockchain “work” together in a more efficient way. It allows forkless updates which considerably enhance throughput and scalability. Apart from blockchains, it also connects oracles, permissioned and consortium chains. All of it is available via Polkadot relay chain, which is transparent and highly secured.&nbsp;<\/p>\n\n\n\n<p>One of the main advantages of the relay chain is the ability to exchange data between different chains and ecosystems without any drastic system changes, updates or hard forks.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">About tech background&nbsp;<\/h3>\n\n\n\n<p>Polkadot is a blockchain which is created within the <a href=\"https:\/\/blaize.tech\/article-type\/best-platforms-for-blockchain-development\/\" target=\"_blank\" rel=\"noreferrer noopener\">Substrate<\/a> framework.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Read more about Substrate specific features in our article<a rel=\"noreferrer noopener\" href=\"https:\/\/blaize.tech\/article-type\/best-platforms-for-blockchain-development\/\" target=\"_blank\"> Best Platform for Blockchain Development<\/a><\/strong><\/p>\n\n\n\n<p>Substrate has a huge kit of tools that enable <a href=\"https:\/\/blaize.tech\/decentralized-application\/\">dapp development<\/a> of any size and kind. Such a wide spectrum of possibilities allows for advanced and complex blockchain building.&nbsp;<\/p>\n\n\n\n<p>At the time of its release, Polkadot blockchain was the first and the main Substrate project. Apart from Polkadot, Substrate framework is a home for many other dapps and blockchains which can be easily integrated with Polkadot due to a similar ecosystem environment. Therefore, we can say that Polkadot is a platform for Substrate based <a href=\"https:\/\/blaize.tech\/article-type\/top-successful-defi-startups\/\">blockchain DeFi startups<\/a> in particular.&nbsp;<\/p>\n\n\n\n<p>In addition, Polkadot provides bridges for not-integrated chains such as Ethereum and Bitcoin.&nbsp;<\/p>\n\n\n\n<p>At this moment Polkadot is in the phase of mainnet release. So, it still has disabled parachain slots. On the other hand, Web3 Foundation enabled Polkadot “little” brother Kusama to take advantage of the projects&#8217; kick offs.&nbsp;Read: <strong><a href=\"https:\/\/blaize.tech\/article-type\/what-to-expect-blaize-predictions-of-blockchain-development-trends-in-2021\/\">Blockchain Technology Trends<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"KUSAMA\">Kusama<\/h2>\n\n\n\n<p>Kusama is, as its website says, a Polkadot “cousin” and is built on Substrate as well. It was created by the co-founder of Polkadot and utilizes approximately the same codebase.&nbsp;Therefore, it can rightfully be considered one of the top Polkadot projects.<\/p>\n\n\n\n<p>The main aim of Kusama is to create an environment pleasant to test innovative or fast-building projects, as well as to make the pre-check before deploying startups on Polkadot. It is important to distinguish that this is not a test-chain, this is the place for experiments and test development checking.&nbsp;<\/p>\n\n\n\n<p>After a successful test, It is not necessary to move your project to Polkadot. You can stay exclusively with Kusama, as long as it is a completely independent parachain project owned and governed by the KSM token holders.&nbsp;<\/p>\n\n\n\n<p>With the help of KSM tokens, holders can validate transactions or name validators, link parachains, pay for transactions or vote on common matters. Interestingly, in case of buying DOT (Polkadot tokens), the holder may expect the same share in the Kusama ecosystem.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How to start ?<\/h3>\n\n\n\n<p>In order to fulfill a test, a project should register a Kusama account. It is permissionless and accessible for everyone. <\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\"><strong><em>Thinking of bringing life to a <a href=\"https:\/\/blaize.tech\/for-startups\/\">new startup<\/a><\/em><\/strong> <strong><em>or project on Polkadot? <a href=\"#post_contact\">Blaize experts <\/a>are here to help with your initiative.&nbsp;&nbsp;<\/em><\/strong><\/p>\n\n\n\n<p>Being a Polkadot project, Kusama requires a very little KSM amount in order to get in and connect your project in comparison with its named “cousin”. The same &#8211; meaning lower &#8211; fees are applied to validation and staking processes as well. This is one of the advantages new-born Polakdot projects should be happy about.&nbsp;<\/p>\n\n\n\n<p>The exact amount you should pay is calculated according to <a href=\"https:\/\/guide.kusama.network\/docs\/en\/learn-phragmen\" target=\"_blank\" rel=\"noreferrer noopener\">Phragmen’s method<\/a>. Phragmen’s method helps to select the most “suitable” validator in two steps. The first one is to pick a certain (<em>x<\/em>) amount of users based on the votes’ stake-weight. Then it strives to equalize the variance of the stake for each validator.&nbsp;<\/p>\n\n\n\n<p>The user can get KSM in two ways. The first one is to claim DOT token and get the proportional amount of Kusama tokens. the user claims Kusama tokens with the help of MyCrypto app. <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"980\" height=\"405\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/05\/07IjPZ_-Wcf-lI4NH.png\" alt=\"\" class=\"wp-image-33151\"\/><figcaption class=\"wp-element-caption\"><em>MyCrypto Kusama tokens claim<\/em><\/figcaption><\/figure>\n\n\n\n<p>After confirming the claim, KSM tokens will be transferred to the account the user specified.&nbsp;<\/p>\n\n\n\n<p>The second way is to buy KSM on one of the existing exchanges, for instance Bitfinex, Binance or Kraken.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>According to this all, Kasuma becomes a very much-needed platform for young startups or other innovative projects on Polkadot. Well, if you do not have much funding or just want to test the idea this is a perfect place to start.&nbsp;<\/strong><\/p>\n\n\n\n<p>So there is a list of upcoming projects on Polkadot worth to know about:<\/p>\n\n\n\n<ol>\n<li><a href=\"#acala\">Acala<\/a><\/li>\n\n\n\n<li><a href=\"#moonbeam\">Moonbeam<\/a><\/li>\n\n\n\n<li><a href=\"#centrifuge\">Centrifuge<\/a><\/li>\n\n\n\n<li><a href=\"#edgeware\">Edgeware<\/a><\/li>\n<\/ol>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"acala\">Acala&nbsp;<\/h2>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/acala.network\/\" target=\"_blank\">Acala<\/a> network is the first Decentralized Financial Consortium and is considered as one of the best projects on Polkadot to be launched at the beginning of next year. Its main aim is to bring DeFi to the Polkadot ecosystem.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\"><strong>If you want to develop your own DeFi project as good as Acala did, look into some useful tips and recommendations from our guide on <a href=\"https:\/\/blaize.tech\/article-type\/how-to-build-a-successful-defi-project\/\" target=\"_blank\" rel=\"noreferrer noopener\">How to Build a Successful DeFi Project<\/a><\/strong><\/p>\n\n\n\n<p>It has its own token (ACA) which is used in protocol governance. It means Acala is fully decentralized and owned by its token holders which are able to vote and validate and run the Acala network in general.&nbsp;<\/p>\n\n\n\n<p>Acala is a dual-protocol network, which means it has two separate protocols in it.&nbsp;<\/p>\n\n\n<div class=\"wp-block-image\">\n<figure class=\"aligncenter size-large is-resized\"><img loading=\"lazy\" decoding=\"async\" width=\"1782\" height=\"736\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_1.png\" alt=\"Acala project on polkadot dual protocol \" class=\"wp-image-2720\" style=\"width:782px;height:321px\" srcset=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_1.png 1782w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_1-1536x634.png 1536w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_1-1568x648.png 1568w\" sizes=\"(max-width: 1782px) 100vw, 1782px\" \/><figcaption class=\"wp-element-caption\"><em>Acala network Dual Protocol system <\/em><\/figcaption><\/figure><\/div>\n\n\n<h3 class=\"wp-block-heading\">What is Honzol Protocol?&nbsp;<\/h3>\n\n\n\n<p>Honzol Protocol is responsible for Acala&#8217;s first project aUSD. aUSD is a cross-chain and multi-collateralized <a href=\"https:\/\/blaize.tech\/services\/understanding-stablecoin\/\" target=\"_blank\" rel=\"noreferrer noopener\">stablecoin<\/a> which can be used within the Polkadot network. Therefore, aUSD enables participants to receive rewards in USD.<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Read more about stablecoin basics in our article <a href=\"https:\/\/blaize.tech\/article-type\/understanding-stablecoin\/\" target=\"_blank\" rel=\"noreferrer noopener\">Understanding Stablecoin<\/a><\/strong><\/p>\n\n\n\n<p>Acala stablecoin is firstly collateralized by DOT and X-BTC, but not limited to those two. As long as it is a cross-chain stablecoin, it can be collateralized by any other asset existing in the Polkadot environment. Such a revolutionary approach will also provide easier and scalable lend, borrow and exchange processes to all blockchains connected to Polkadot.&nbsp;&nbsp;<\/p>\n\n\n\n<p><strong><em>If you are already impressed by Honzol, wait for it and read further about Homa protocol.&nbsp;<\/em><\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What is Homa Protocol?&nbsp;<\/h3>\n\n\n\n<p>While having DOT tokens, the user either uses it through the network or skates it to the system. In order to enable its usage while staked, Acala introduces the Homa Protocol. With its help, the user stakes the DOT and receives (liquid DOT) L-DOTs as a derivative in return. L-DOTs holders are able to participate in the validation system the same as regular DOTs holders. Additionally, the team is currently working on unlocking the ability to participate in Polkadot on-chain governing for Liquid DOT owners.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Homa liquidity protocol makes a true revolution because it enables earning from token staking, while not limiting its utilization within the network. Homa Protocol also allows usage of L-DOTs as collateral for Honzal stablecoins. Such manipulations “release” the liquidity and make additional rewarding possible by investing in various DeFi dapps.<\/strong>&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"moonbeam\">Moonbeam&nbsp;<\/h2>\n\n\n\n<p><a href=\"https:\/\/moonbeam.network\/\" target=\"_blank\" rel=\"noreferrer noopener\">Moonbeam<\/a> is another successful Polkadot project, an Ethereum-compatible platform for smart contract deployment. Along with connection to Polkadot, it will provide its users the bridge to a well-known and convenient toolkit of Ethereum system. Moonbeam also runs its own utility token called Glimmer (GLMR) which is used to pay transaction fees and smart contracts’ execution.&nbsp;<\/p>\n\n\n\n<p>Moonbeam stays for convenient and developer-oriented blockchain in premier. While providing a choss-chain smart contract ability, Moonbeam may help to extend existing workloads and dapps features in general.<\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/ethereum-based-dapp-development-for-trading-platform\/\">dApp Examples or How To Create a dApp<\/a><\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How does cross-chain smart contract work?<\/h3>\n\n\n\n<figure class=\"wp-block-embed is-type-video is-provider-youtube wp-block-embed-youtube wp-embed-aspect-16-9 wp-has-aspect-ratio\"><div class=\"wp-block-embed__wrapper\">\n<iframe loading=\"lazy\" title=\"Tutorial: How to Deploy and Interact with a Smart Contract in Moonbeam (Web3 Library and JavaScript)\" width=\"640\" height=\"360\" src=\"https:\/\/www.youtube.com\/embed\/CRYfejvqNzg?feature=oembed\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen><\/iframe>\n<\/div><figcaption class=\"wp-element-caption\"><em>How to Deploy and Interact with a Smart Contract in Moonbeam<\/em><\/figcaption><\/figure>\n\n\n\n<p>In order to make Ethereum compatibility possible, Moonbeam provided a full EVM implementation. It also designed a web3 compatible API and cross-bridges that connect it to the Ethereum network. Thanks to that, participants will be able to deploy already written Solidity contracts on Moonbeam without significant changes. The same approach is applied to dApps front-end, so such tools as MetaMask or truffle can be transferred to Moonbeam with no modifications.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Moonbeam is a Polkadot project which will solve a range of problems connected to cross-chain smart contract running. Moreover, users will also benefit from in-built integration of a smart contract platform that will be surely faster than self-standing runtime performance.&nbsp;<\/strong><\/p>\n\n\n\n<p>Moonbeam is an upcoming project on Polkadot yet.<strong> <\/strong>The whole Blaize team is kindly expecting Moonbeam launch on Polkadot MainNet in the second quarter of 2021.&nbsp;Read about possible interaction with this protocol in <a href=\"https:\/\/blaize.tech\/article-type\/how-to-launch-a-project-on-polkadot-dapp-parachain-and-bridge\/\" target=\"_blank\" rel=\"noreferrer noopener\">How to Build Smart contracts on Polkadot<\/a>. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"centrifuge\">Centrifuge&nbsp;<\/h2>\n\n\n\n<p>Centrifuge is a protocol for decentralized financial assets compatible with the Polkadot ecosystem. This is another DeFi initiative within Polkadot startups. It tightly cooperates with MakerDAO, Circle, and <strong><a href=\"https:\/\/blaize.tech\/article-type\/celo-project-python-sdk-overview\/\" target=\"_blank\" rel=\"noreferrer noopener\">Celo Protocol<\/a><\/strong> with the main aim to build a world of fair finance.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Centrifuge enables lending capital against real-world assets in a trustless and secured way. It basically consists of two parts: Tinlake and Centrifuge chain.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What is Centrifuge chain?&nbsp;<\/h3>\n\n\n\n<p>Centrifuge chain is a Substrate based blockchain which uses a PoS consensus mechanism. It also has its own token <a href=\"https:\/\/ctrf-tk-ppr.s3-us-west-1.amazonaws.com\/Centrifuge+Token+Design+Spec+v0.5.pdf\" target=\"_blank\" rel=\"noreferrer noopener\">Radial token<\/a> (RAD) in order to enable on-chain governance and perform transactions within the Centrifuge blockchain.&nbsp;<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p><em>“We built Centrifuge Chain to enable businesses to exchange business documents (such as invoices) and tokenize those assets to have greater access to financing — thereby unlocking value that has previously been inaccessible. Our mission is to change the rules of global trade to foster economic opportunity everywhere”.<\/em><\/p>\n<cite><em>Centrifuge<\/em><\/cite><\/blockquote>\n\n\n\n<p>Centrifuge chain as the first enables its participants to convert real world assets to the NFTs (non-fungible token). Thus, may be further used as a collateral in exchange for stable assets in Tinlake dapp.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Centrifuge chain is somehow a unique ecosystem that is built in order to give a start to Tinlake. Such approach takes Tinlake to another level and makes it strongly competitive with other currently existing DeFi dapps.&nbsp;<\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What is Tinlake?&nbsp;<\/h3>\n\n\n\n<p>Tinlake is an Ethereum based decentralized app which allows borrowers and investors to create, finance and manage their own asset pools.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1920\" height=\"846\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_3.png\" alt=\"Centrifuge Tinlake project on polkadot\" class=\"wp-image-2721\" srcset=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_3.png 1920w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_3-1536x677.png 1536w, https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_3-1568x691.png 1568w\" sizes=\"(max-width: 1920px) 100vw, 1920px\" \/><figcaption class=\"wp-element-caption\"><em>Tinlake Protocol scheme of wor<\/em><\/figcaption><\/figure>\n\n\n\n<p>The protocol uses provided NFTs as a collateral. Blaze often uses the protocol when <strong><a href=\"https:\/\/blaize.tech\/nft-development-services\/\">developing NFTs<\/a><\/strong>. In exchange, it gives a stablecoin such as USDC or DAI. This is possible due to the emission of fungible DROP and TIN tokens which the user gets while providing liquidity to the pool.<\/p>\n\n\n\n<p>Moreover, all Tinlake pools are independent and one user can create multiple pools. For instance, one pool for invoices and one for loans or mortgages. In case of creation many pools, risks and liquidity providing earnings are shared within one pool, not for all pools the user has.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Summarizing, Tinlake is very useful and valuable for both: investors and borrowers so-called originators. While providing a transparent and highly secured asset holding environment for the first, it enables cost-efficient and bankless lends for the others.&nbsp;<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"edgeware\">Edgeware&nbsp;<\/h2>\n\n\n\n<p><a rel=\"noreferrer noopener\" href=\"https:\/\/edgewa.re\/#\" target=\"_blank\">Edgeware<\/a> is a Substrate based chain that plans to connect with Polkadot as a parachain in 2021. It will allow smart contract creation within the ecosystem. Its smart contracts are written in Rust and compiled into WASM &#8211; a very convenient technique for Substrate based blockchains.<\/p>\n\n\n\n<p>Within Edgware users are able to perform voting and funding processes as well as delegate their rights due to nPoS &#8211; nominated Proof of Stake &#8211; consensus. One of the main goals of the network was (and still remain) to build a pleasant test environment for on-chain governance. Hence, Edgeware is built so that the system implements self-improvements and then asks participants to vote on them.&nbsp;<\/p>\n\n\n\n<p>Read More: <strong><a href=\"https:\/\/blaize.tech\/article-type\/analysis\/how-to-launch-an-ico-sto-or-ieo-in-2023-benefits-tips-best-practices\/\">How to Launch an ICO, STO, or IEO<\/a><\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">What’s new?<\/h3>\n\n\n\n<figure class=\"wp-block-image aligncenter size-large\"><img loading=\"lazy\" decoding=\"async\" width=\"1234\" height=\"600\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/Blaze-05102020_2.png\" alt=\"Edgeware project on polkadot stack system Parity Substrate\n\" class=\"wp-image-2722\"\/><figcaption class=\"wp-element-caption\">The Edgeware Stack <\/figcaption><\/figure>\n\n\n\n<p>Edgeware ecosystem is able to provide on-going self-improvement without system stoppage and any drastic changes. This is possible thanks to the Substrate base which network uses. Due to the blockchain modularity Edgeware offers, different blockchain parts are separated from each other in modules so that the one performs changes to a single part, not the whole system. This allows for quick and on-chain improvements while having just a part of a new code in a hand.&nbsp;<\/p>\n\n\n\n<p>In order to spread its tokens (EDG), the Edgeware network used a first of its kind lockdrop method. According to it, in order to join, a participant has to lock up his ETH and then get EDG in return. As soon as ETHs are locked in a smart contract, a participant gets a proportional number of EDG according to the ETH amount and a lockdrop duration time. There are three time slots: 3 months, 6 months, and 1 year. After the expiry date, the whole amount of ETHs goes back to its owner.&nbsp;&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong>Edgeware is a cutting edge solution in terms of instant self-improvement and highly speeded smart contract execution and system updates. Integration with other projects on Polkadot within one multichain makes it even more promising.&nbsp;<\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion&nbsp;<\/h2>\n\n\n\n<p>Polkadot ecosystem brings to life an amazing initiative of cross-chain communication and data exchange. While being designed within Substrate framework, it can offer a way new level of blockchain ecosystem persistence in general. Along with that, it creates a pleasant and convenient environment for development of new startups in Polkadot ecosystem.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\"><em>In Blaize, we are fascinated with the new technologies and upcoming startups. Want to <a href=\"https:\/\/blaize.tech\/article-type\/how-to-launch-a-project-on-polkadot-dapp-parachain-and-bridge\/\" target=\"_blank\" rel=\"noreferrer noopener\">launch your own dApp on Polkadot<\/a> that will take the market in the nearest future? <a href=\"#post_contact\">Contact Blaize<\/a> experts to start the development or answer any questions you have.&nbsp;<\/em><\/p>\n","protected":false},"excerpt":{"rendered":"<p>Polkadot unites the entire network of multiple blockchains into one decentralized ecosystem. While enabling a<a href=\"https:\/\/blaize.tech\/blog\/top-startups-on-polkadot-that-will-rock-in-2021\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":357,"featured_media":2725,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[285,279,452,288,278],"tags":[306,305,439,330],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Top Projects on Polkadot that will rock in 2021 - Blaize<\/title>\n<meta name=\"description\" content=\"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Top Projects on Polkadot that will rock in 2021 - Blaize\" \/>\n<meta property=\"og:description\" content=\"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2020-10-05T07:55:30+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:15+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/polkadot-image1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Dmytro Kovalchuk\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dmytro Kovalchuk\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/top-startups-on-polkadot-that-will-rock-in-2021\/\",\"url\":\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\",\"name\":\"Top Projects on Polkadot that will rock in 2021 - Blaize\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2020-10-05T07:55:30+00:00\",\"dateModified\":\"2024-10-29T11:10:15+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/d1ccf26e4f3d2fe940bf1f087d1a8f9b\"},\"description\":\"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Top Projects on Polkadot that will rock in 2021\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/d1ccf26e4f3d2fe940bf1f087d1a8f9b\",\"name\":\"Dmytro Kovalchuk\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/dima.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/dima.png\",\"caption\":\"Dmytro Kovalchuk\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Top Projects on Polkadot that will rock in 2021 - Blaize","description":"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/","og_locale":"en_US","og_type":"article","og_title":"Top Projects on Polkadot that will rock in 2021 - Blaize","og_description":"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.","og_url":"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/","og_site_name":"Blaize","article_published_time":"2020-10-05T07:55:30+00:00","article_modified_time":"2024-10-29T11:10:15+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/10\/polkadot-image1.png","type":"image\/png"}],"author":"Dmytro Kovalchuk","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Dmytro Kovalchuk","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/top-startups-on-polkadot-that-will-rock-in-2021\/","url":"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/","name":"Top Projects on Polkadot that will rock in 2021 - Blaize","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2020-10-05T07:55:30+00:00","dateModified":"2024-10-29T11:10:15+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/d1ccf26e4f3d2fe940bf1f087d1a8f9b"},"description":"While enabling transparent and easy cross-chain communication it becomes a very powerful tool for building decentralized projects on Polkadot.","breadcrumb":{"@id":"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Top Projects on Polkadot that will rock in 2021"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/d1ccf26e4f3d2fe940bf1f087d1a8f9b","name":"Dmytro Kovalchuk","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/dima.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/dima.png","caption":"Dmytro Kovalchuk"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2696"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/357"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=2696"}],"version-history":[{"count":38,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2696\/revisions"}],"predecessor-version":[{"id":70075,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/2696\/revisions\/70075"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/2725"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=2696"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=2696"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=2696"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}