{"id":3556,"date":"2020-12-09T09:46:14","date_gmt":"2020-12-09T09:46:14","guid":{"rendered":"https:\/\/6F6F5DB1-6ED1-493C-91CB-C41FA6BBFDE6"},"modified":"2024-10-29T11:10:09","modified_gmt":"2024-10-29T11:10:09","slug":"ethereum-based-dapp-development-for-trading-platform","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/ethereum-based-dapp-development-for-trading-platform\/","title":{"rendered":"Ethereum dApp Development Guide with examples"},"content":{"rendered":"\n<p>Decentralized applications (DApps) are revolutionizing the way we trade and exchange assets. Good old Ethereum is the grandpa of numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push further the interest in the process of building a dApp on Ethereum.&nbsp;<\/p>\n\n\n\n<p>From designing the architecture to implementing smart contracts, the article provides valuable insights for developers looking to build secure and scalable trading platforms using blockchain technology. By leveraging the benefits of the Ethereum network, businesses can create transparent and efficient decentralized applications that enhance security and trust in the marketplace.<\/p>\n\n\n\n<p>In this article, we would show and describe different types of dApps, their variations and distinctive features regarding the hosting blockchain. <strong>We will also show the real-life example of Ethereum dapp development using one of Blaize case studies.<\/strong>&nbsp;<\/p>\n\n\n\n<p>But firstly, let’s define the type of dApp you want to create.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is dApp?&nbsp;<\/h2>\n\n\n\n<p>DApp is shortened from decentralized application and stands for<strong> a web application that interacts with blockchain<\/strong> in general and smart contracts in particular.&nbsp;<\/p>\n\n\n\n<p>Unlike standard (or centralized) applications that are deployed on a certain server and work with its private database, decentralized apps rely on blockchain. They can be deployed from scratch and need just the connection to the closest node.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Types of dApps<\/h2>\n\n\n\n<p>As far as technology grows and improves, there are a few types of dApps we can differentiate for now. We can basically divide them according to three main categories.&nbsp;<\/p>\n\n\n\n<p><strong>The first type of dApps communicates with the blockchain protocol directly. <\/strong>The most common Ethereum dApps examples are wallets and explorers, like Bitcoin wallet, MetaMask, Polkascan, Etherscan, etc. In other words, those are dapps for the transport layer of the network when compared with the OSI model.<\/p>\n\n\n\n<p><strong>The second level represents dapps that communicate primarily with smart contracts<\/strong> <strong>and occasionally with the protocols.<\/strong> They are often hosted by one of the existing blockchains. EOS, Ethereum, and Tron are <a href=\"https:\/\/blaize.tech\/article-type\/best-platforms-for-blockchain-development\/\" target=\"_blank\" rel=\"noreferrer noopener\">top blockchain platforms<\/a> for dApps development.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1400\" height=\"982\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/05\/0tb12ZVRm8Rs3g0Gs.png\" alt=\"The visualization of dApps levels corresponding to its classification types\" class=\"wp-image-33028\"\/><figcaption><em>The visualization of dApps levels corresponding to its classification types<\/em><\/figcaption><\/figure>\n\n\n\n<p>Akropolis, Compound, Acala, yEarn &#8211; all of them are second level dApps. In spite of the fact that those are often called protocols, they are the actual apps (application) in their nature which interact with a decentralized environment.&nbsp;<\/p>\n\n\n\n<p>We will dare to name <strong>the third level as a meta-level, which represents not application aggregators, but a large additional solution on top of the protocol. <\/strong>In particular, those are any layer-2 solutions or sidechains like <a href=\"https:\/\/docs.ethhub.io\/ethereum-roadmap\/layer-2-scaling\/plasma\/\" target=\"_blank\" rel=\"noreferrer noopener\">Plasma<\/a>.&nbsp;<\/p>\n\n\n\n<p>The other good example of it might be any of the future dapps for increasing interoperability within the Polkadot network when parachains, bridges, and other cross-chain solutions will be connected.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><em><strong>Get to know more about how Polkadot works, what are the <strong><a href=\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\">best startups on Polkadot<\/a><\/strong> and some of the significant upcoming projects for this network <a href=\"https:\/\/blaize.tech\/services\/top-startups-on-polkadot-that-will-rock-in-2021\/\" target=\"_blank\" rel=\"noreferrer noopener\">in this article<\/a>.&nbsp;&nbsp;<\/strong><\/em><\/p>\n\n\n\n<p><strong><em>To summarize, the two first types of dApps contact the protocol and work inside of it (as far as we know that smart contracts also exist inside the chain). At the same time, the third level dapps go beyond the protocol and improve or broaden its operability.<\/em><\/strong><\/p>\n\n\n\n<p>As you have gone through the dApps types, you can identify which solution is the best for your project. In Blaize, we deal with all types of dApp development, yet we want to underline that during the period of Ethereum Beacon chain release, the amount of dApps built on top of this network is expected to grow. Therefore, in the next part of this article, we would like to share our experience on how to build an Ethereum dapp.&nbsp;<\/p>\n\n\n\n<h2 class=\"mb-0 has-background wp-block-heading\" style=\"background-color:#f7f7f9\"><strong>What about Ethereum 2.0?&nbsp;<\/strong><\/h2>\n\n\n\n<p class=\"mb-0 has-background\" style=\"background-color:#f7f7f9\">Blaize blockchain engineers are true experts in their specific fields, so it is very important for us to find out about all the new updates of the system. Talking about the release of Ethereum 2-layer probably many of users are confused about what will happen with currently hosted dApps on the 1.0 version.&nbsp;<\/p>\n\n\n\n<p class=\"mb-0 has-background\" style=\"background-color:#f7f7f9\">To keep your inner peace, as for now, nothing will happen with the already existing dApps, and their owners do not have to do a thing with them. Additionally, dApp development is still maintained on the Ethereum 1.0 version while 2.0 along with Beacon chain is aimed to introduce the new PoS consensus and provide crosslinks for the future integration of sharding.&nbsp;<\/p>\n\n\n\n<p class=\"mb-0 has-background\" style=\"background-color:#f7f7f9\">It is worth noting that sooner or later Ethereum 1.0 dApp owners will have to migrate to the second version, but for now rules remain unchanged.&nbsp;<\/p>\n\n\n\n<p class=\"has-background\" style=\"background-color:#f7f7f9\">Besides concerns about Ethereum 2.0, there are a few issues such as the upgrade of Metamask, which should not be disregarded while creating dapp architecture at the current version of Ethereum. That is why we want to turn your attention to this and concentrate on the modern approach to Ethereum dapp development.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ethereum dApp development [ the trading platform&nbsp;case study]<\/h2>\n\n\n\n<p>Blaize got involved in the project in the trading and stock markets sphere. Our main goals regarding this project were the creation of Ethereum-based application packages and smart contracts development for this dApp functionality. In this part, we will share the experience of our real case of building a trading platform using Ethereum-based DApps.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>About the client&nbsp;<\/strong><\/h2>\n\n\n\n<p>This case is under NDA protection so Blaize cannot publicize the name of this client and share any unique project specifications. However, the implementation of this project reflects perfectly the whole cycle of making a decentralized application on Ethereum and therefore helps us to show Blaize approach to dApp development in the best way.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Project overview&nbsp;<\/strong><\/h2>\n\n\n\n<p>The client came with an idea to create a secured and reliable platform to manage crypto assets and provide rewards for token holders. The platform must support its own <a href=\"https:\/\/blaize.tech\/article-type\/tokenomics-for-crypto-games-how-to-develop-economy-for-gamefi\/\">tokenomics<\/a> with two kinds of native tokens.<\/p>\n\n\n\n<p>The first token should act as a regular ERC-20 token, and be an asset for internal credit rewards. The second token will represent the rewards themselves, which are charged for keeping ETH on the balance.<\/p>\n\n\n\n<p>Read also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/amm-types-differentiations\/\">AMM Types &amp; Differentiations<\/a><\/strong><\/p>\n\n\n\n<p>In other words, the user provides Ether while trading and keeping it to the system. Every month the system should create a snapshot of the token holders, which stands for the list of active users. Then, the system distributes rewards monthly in accordance with the user’s activity within the platform.&nbsp;&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Project scope&nbsp;<\/strong><\/h2>\n\n\n\n<p><strong>We can generally split the whole project implementation into three parts:&nbsp;<\/strong><\/p>\n\n\n\n<p><strong><span class=\"has-inline-color has-primary-red-color\">1 Phase:<\/span><\/strong>&nbsp; includes smart contract development and its further coverage with tests;<\/p>\n\n\n\n<p><strong><span class=\"has-inline-color has-primary-red-color\">2 Phase:&nbsp;<\/span><\/strong> concentrates on Ethereum-based dApp development with additional MetaMask integration;<\/p>\n\n\n\n<p><strong><span class=\"has-inline-color has-primary-red-color\">3 Phase:<\/span><\/strong> consist of backend service and eventual dApp upgrades.&nbsp;<\/p>\n\n\n\n<p><em><strong>Recently we have been sharing a few articles regarding <a href=\"https:\/\/blaize.tech\/article-type\/how-to-build-a-successful-defi-project\/#Smart-contracts-development\" target=\"_blank\" rel=\"noreferrer noopener\">smart contract development<\/a> and <a href=\"https:\/\/blaize.tech\/article-type\/how-to-conduct-a-smart-contract-security-audit-of-your-project-and-why-this-is-important\/\" target=\"_blank\" rel=\"noreferrer noopener\">conducting security audits of smart contracts<\/a> along with unit test coverage preparation. So, in this article, we want to move to the part describing dApp development and the following challenges.&nbsp;<\/strong><\/em><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How Blaize built a dapp: developing a web wallet<\/h2>\n\n\n\n<p>The dApp required for this kind of project represents <strong>the second type of dApps<\/strong> and uses Ethereum smart contract as a base.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"951\" height=\"216\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/05\/038yliaLI3Lm11E-x.png\" alt=\"How to develop ethereum dApps\" class=\"wp-image-33030\"\/><\/figure>\n\n\n\n<p>In order to anyhow interact with Ethereum blockchain, every dApp needs a <a href=\"https:\/\/metamask.io\/\" target=\"_blank\" rel=\"noreferrer noopener\">MetaMask<\/a> integration. This makes the performance process smoother and eliminates unwanted frictions.&nbsp;Our <strong><a href=\"https:\/\/blaize.tech\/for-startups\/\">blockchain consulting team<\/a><\/strong> can help you integrate MetaMask into your dApp for a seamless and secure trading experience.<\/p>\n\n\n\n<p>In terms of trading platform, MetaMask is used for dApp logging, sending the transactions, and getting the service info about the user&#8217;s holdings along with other data. Also, it stores the actual user account which is used for receiving the funds and rewards.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">How Blaize built a blockchain app: developing an Ethereum dApp<\/h2>\n\n\n\n<p>The application was built using <strong>React and Node.js<\/strong>. During this phase Blaize engineers concentrate on launching an actual dApp in the following steps:&nbsp;<\/p>\n\n\n\n<ul><li>connect to Ethereum network using the injected web3 provider from previously installed MetaMask;<\/li><li>configure with the previously built smart contracts;&nbsp;<\/li><li>load and deploy smart contracts;<\/li><\/ul>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\">Blaize engineers recommend using the <a href=\"https:\/\/openzeppelin.com\/\" target=\"_blank\" rel=\"noreferrer noopener\">OpenZeppelin<\/a> framework for upgradable contracts in order to ensure safe and smooth contract updates. Thanks to its usage, you can check for the updates and apply them automatically during the deployment. It will also watch all the new changes and recompile the contracts automatically.&nbsp;<\/p>\n\n\n\n<ul><li>connect with Infura node.<\/li><\/ul>\n\n\n\n<p>You can see an example of an Ethereum-based blockchain app through this code sample.&nbsp;<\/p>\n\n\n<script src=\"https:\/\/gist.github.com\/2b84b60705e8416200145e8b9026af4d.js\"><\/script>\n\n\n\n<h2 class=\"wp-block-heading\">Difficulties of dApp development for trading platform&nbsp;<\/h2>\n\n\n\n<p>As the main challenges of dApp development, we can underline the complexity of initial business logic and tokenomics the application is aimed to use. Projects of this kind require very thoughtful and time-consuming analysis of all the possible interactions between app and contracts, app and user, app and Subgraph storage. <a href=\"https:\/\/blaize.tech\/for-enterprises\/\"><strong>Enterprise blockchain services<\/strong><\/a> play a crucial role in addressing these challenges and ensuring the successful implementation of blockchain projects.<\/p>\n\n\n\n<p><strong><em><span class=\"has-inline-color has-primary-red-color\">Therefore, a team of blockchain engineers with previous experience in <\/span><\/em><\/strong><a href=\"https:\/\/blaize.tech\/decentralized-application\/\" target=\"_blank\" rel=\"noreferrer noopener\"><em><span class=\"has-inline-color has-primary-red-color\"><strong>dApp implementation<\/strong><\/span><\/em><\/a><strong><em><span class=\"has-inline-color has-primary-red-color\"> on Ethereum, <\/span><\/em><\/strong><em><strong><span class=\"has-inline-color has-primary-red-color\"><a href=\"https:\/\/blaize.tech\/smart-contracts\/\" target=\"_blank\" rel=\"noreferrer noopener\">token development<\/a>,<\/span><\/strong><\/em><strong><em><span class=\"has-inline-color has-primary-red-color\"> and integration is a must.&nbsp;<\/span><\/em><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Websocket drop fix<\/strong><\/h2>\n\n\n\n<p>One of the main problems was implementing transaction history in a dApp while having the rewarding system on the backend.&nbsp;<\/p>\n\n\n\n<p>In order to make the transaction history visible for users, there is a need of getting the data from the Ethereum node WebSocket. Such an approach requires the processing of a huge amount of data coming from the node during each transfer to the “transactions” section.&nbsp;<\/p>\n\n\n\n<p>The communication between transaction history and reflected data on the dApp can be dropped due to WebSocket occasional connection issues. Therefore, we needed to implement the functionality to eliminate possible disconnections. We have developed an additional worker which watches the WebSocket and fixes the occurring drops.&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Solution for requests limit&nbsp;<\/strong><\/h2>\n\n\n\n<p>While entering the application, the user begins to request data from contracts. The <a href=\"https:\/\/infura.io\/\" target=\"_blank\" rel=\"noreferrer noopener\">Infura<\/a> key is one and the same for all dapp users. As the number of users grew, it became necessary to increase the number of possible requests from Infura.<\/p>\n\n\n\n<p>In order to solve this problem, we needed to optimize the requests’ processing on the Ethereum node. We have performed this by keeping most of the received information in the Redux store, and updating it from time to time (caching).<strong> It helped to reduce the number of requests by 10 times.<\/strong><\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><strong><em>Want to optimize your current solution in such a way? Do not hesitate to <a href=\"#post_contact\">contact<\/a> and we will tell<\/em> <em>how we can do it together! <\/em><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Subgraph integration&nbsp;<\/strong><\/h2>\n\n\n\n<p>The trading platform has to store large and extensive transaction history that slows down the application performance. An excellent solution is to receive transaction data not through the Infura hosted Ethereum node but through a specialized service.&nbsp;<\/p>\n\n\n\n<p>We decided to implement <a href=\"https:\/\/thegraph.com\/docs\/define-a-subgraph\" target=\"_blank\" rel=\"noreferrer noopener\">Subgraph<\/a> hosted on The Graph service, which indexes the transaction history (and other data) in real-time. Subgraph usage helps to optimize a system&#8217;s work and makes it very efficient. The service is free, which additionally helps to optimize costs.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong><em><span class=\"has-inline-color has-primary-red-color\">See other example of Subgraph implementation in our <a href=\"https:\/\/blaize.tech\/article-type\/how-to-build-a-successful-defi-project\/\">snglsDAO case<\/a> description.&nbsp;<\/span><\/em><\/strong><\/h4>\n\n\n\n<p>We deployed the Subgraph for this application. Dapp is reconfigured to interact with Subgraph using GraphQL. Thus, we remade the architecture of the application so that it receives history not from contracts or node, but from the Subgraph.<\/p>\n\n\n\n<p><strong>In order to build decentralized application for trading platform Blaize used following technologies:&nbsp;<\/strong><\/p>\n\n\n\n<ul><li>Front-end: <strong>React<\/strong>, Redux, React-bootstrap, Web3.js<\/li><li>Backend: <strong>Node.js<\/strong>, MongoDB, Docker, Web3.js<\/li><li>Blockchain: <strong>Ethereum, Solidity<\/strong>, Truffle<\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion&nbsp;<\/h2>\n\n\n\n<p>From this article, you know the process of developing dApps on Ethereum and some of the crucial specifications of it. As you can see in order to provide dApp development services, the company needs to possess a vast knowledge of different blockchain platforms and their unique characteristics.&nbsp;<\/p>\n\n\n\n<h4 class=\"has-white-color has-primary-red-background-color has-text-color has-background wp-block-heading\"><strong><em>Need skilled blockchain developers to deploy your own dApp? <\/em><\/strong><a href=\"https:\/\/blaize.tech\/#contacts\" target=\"_blank\" rel=\"noreferrer noopener\"><em><strong>Schedule a call<\/strong><\/em><\/a><strong><em> to answer all your questions or get to know more about our <\/em><\/strong><a href=\"https:\/\/blaize.tech\/decentralized-application\/\" target=\"_blank\" rel=\"noreferrer noopener\"><em><strong>dApp development services<\/strong><\/em><\/a><strong><em>.&nbsp;<\/em><\/strong><\/h4>\n\n\n\n<p>There are also a few crucial differences between existing dApps, so we can divide them into types. This helps to understand the project scope and required skills for your project development.&nbsp;<\/p>\n\n\n\n<p><strong><em>Start developing your dApps on Ethereum with our <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-to-choose-a-reliable-blockchain-company-for-your-project\/\">blockchain development company<\/a><\/strong><\/em><\/strong> <strong><em>Blaize!<\/em><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">FAQ<\/h2>\n\n\n\n<ul><li><strong>How many dApps are on Ethereum?<\/strong><\/li><\/ul>\n\n\n\n<p>The number of dApps on Ethereum is constantly changing as new projects emerge and existing ones evolve. As of the end of the year 2022, there were over 8,000 dApps built on Ethereum. To get the latest figures, you can check platforms like DappRadar or State of the DApps.<\/p>\n\n\n\n<ul><li><strong>What are some examples of dApp based on Ethereum?<\/strong><\/li><\/ul>\n\n\n\n<p>Decentralized finance (DeFi) platforms: Aave, Uniswap, Compound<\/p>\n\n\n\n<p>Non-fungible tokens (NFT) marketplaces: OpenSea, Rarible, SuperRare<\/p>\n\n\n\n<p>Gaming: CryptoKitties, Decentraland, Axie Infinity<\/p>\n\n\n\n<ul><li><strong>How to choose an Ethereum dApp development company?<\/strong><\/li><\/ul>\n\n\n\n<p>Evaluate their experience and expertise in Ethereum development<\/p>\n\n\n\n<p>Check their portfolio and client testimonials<\/p>\n\n\n\n<p>Assess their technical skills and understanding of Ethereum tools<\/p>\n\n\n\n<p>Consider their communication and project management abilities<\/p>\n\n\n\n<ul><li><strong>How can developers overcome challenges in Ethereum dApp development?<\/strong><\/li><\/ul>\n\n\n\n<p>Stay updated on Ethereum network upgrades to optimize performance<\/p>\n\n\n\n<p>Use <a href=\"https:\/\/blaize.tech\/article-type\/overview\/a-comprehensive-guide-on-blockchain-layer-2-scaling-solutions\/\">layer 2 scaling solutions<\/a> to improve transaction throughput and reduce costs<\/p>\n\n\n\n<p>Leverage testing tools and smart contract auditing services to ensure security<\/p>\n\n\n\n<p>Collaborate with the Ethereum community for insights and support<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Decentralized applications (DApps) are revolutionizing the way we trade and exchange assets. Good old Ethereum<a href=\"https:\/\/blaize.tech\/blog\/ethereum-based-dapp-development-for-trading-platform\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":342,"featured_media":3563,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[287,285,289,452,278],"tags":[306,435],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ethereum dApp Development [Guide with Examples] - Blaize<\/title>\n<meta name=\"description\" content=\"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ethereum dApp Development [Guide with Examples] - Blaize\" \/>\n<meta property=\"og:description\" content=\"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2020-12-09T09:46:14+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:09+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/12\/dapp-dev.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Sergey Onyshchenko\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@S_Onishchenko\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sergey Onyshchenko\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/ethereum-based-dapp-development-for-trading-platform\/\",\"url\":\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/\",\"name\":\"Ethereum dApp Development [Guide with Examples] - Blaize\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2020-12-09T09:46:14+00:00\",\"dateModified\":\"2024-10-29T11:10:09+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\"},\"description\":\"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Ethereum dApp Development Guide with examples\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\",\"name\":\"Sergey Onyshchenko\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"caption\":\"Sergey Onyshchenko\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/sergeyonishenko\/\",\"https:\/\/twitter.com\/S_Onishchenko\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Ethereum dApp Development [Guide with Examples] - Blaize","description":"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/","og_locale":"en_US","og_type":"article","og_title":"Ethereum dApp Development [Guide with Examples] - Blaize","og_description":"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.","og_url":"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/","og_site_name":"Blaize","article_published_time":"2020-12-09T09:46:14+00:00","article_modified_time":"2024-10-29T11:10:09+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/12\/dapp-dev.png","type":"image\/png"}],"author":"Sergey Onyshchenko","twitter_card":"summary_large_image","twitter_creator":"@S_Onishchenko","twitter_misc":{"Written by":"Sergey Onyshchenko","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/ethereum-based-dapp-development-for-trading-platform\/","url":"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/","name":"Ethereum dApp Development [Guide with Examples] - Blaize","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2020-12-09T09:46:14+00:00","dateModified":"2024-10-29T11:10:09+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670"},"description":"Ethereum is hosting numerous dApps and contracts. And the recent introduction of Ethereum 2.0 will significantly push the interest in the process dApp development on Ethereum.","breadcrumb":{"@id":"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/services\/ethereum-based-dapp-development-for-trading-platform\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Ethereum dApp Development Guide with examples"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670","name":"Sergey Onyshchenko","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","caption":"Sergey Onyshchenko"},"sameAs":["https:\/\/www.linkedin.com\/in\/sergeyonishenko\/","https:\/\/twitter.com\/S_Onishchenko"]}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3556"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/342"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=3556"}],"version-history":[{"count":27,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3556\/revisions"}],"predecessor-version":[{"id":37706,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3556\/revisions\/37706"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/3563"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=3556"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=3556"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=3556"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}