{"id":3657,"date":"2021-01-04T13:11:17","date_gmt":"2021-01-04T13:11:17","guid":{"rendered":"https:\/\/8BDCC037-548B-42D0-B42F-5762AB1AD4FE"},"modified":"2024-10-29T11:10:07","modified_gmt":"2024-10-29T11:10:07","slug":"which-blockchain-to-fork-to-start-your-own-cryptocurrency","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/","title":{"rendered":"Which Blockchain to Fork to Start Your Own Cryptocurrency"},"content":{"rendered":"\n<p>How many <a href=\"https:\/\/blaize.tech\/article-type\/best-platforms-for-blockchain-development\/\">blockchain platforms<\/a> are there? And which one serves the best for your project implementation? Those are the main questions crossing blockchain entrepreneurs&#8217; minds.&nbsp;<\/p>\n\n\n\n<p>The need for forking in blockchain growing along with technology adaptation to the various business industries. That is why we want to turn your attention to the question of how to <a href=\"https:\/\/blaize.tech\/article-type\/analysis\/how-to-create-your-own-cryptocurrency-from-a-to-z\/\">create your own cryptocurrency<\/a> by forking an existing blockchain, such as the Ethereum blockchain. We will analyze a few current successful solutions and provide step-by-step guidance on how to fork Ethereum and customize it to create your own blockchain-based project.&nbsp;&nbsp;<\/p>\n\n\n\n<p><em><span class=\"has-inline-color has-dark-gray-color\">In the previous article, we made a review concentrating on defining a type of blockchain-based project and <a href=\"https:\/\/blaize.tech\/article-type\/how-to-choose-the-right-blockchain-network-for-your-dapp-development\/\" target=\"_blank\" rel=\"noreferrer noopener\">selecting the right blockchain frameworks for dApp development.<\/a> Read this article to get more information about projects that can implement blockchain forking for the current business solution. <\/span><\/em><\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\">Contact us to learn more about <strong><a href=\"https:\/\/blaize.tech\/decentralized-application\/\">decentralized application development services<\/a><\/strong>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is Blockchain forking?<\/h2>\n\n\n\n<p>A blockchain fork is essentially a split of any existing blockchain. Basically, there are two types of forks we can define: soft and hard forks.&nbsp;<\/p>\n\n\n\n<p>The <strong>soft forks<\/strong> are those that are aimed to insert functional changes within the network so that the system will remain the same, yet all current nodes should be updated to the new rules.&nbsp;<\/p>\n\n\n\n<p>The<strong> hard fork usually results in the <\/strong>creation of new, customized cryptocurrency. An example of such a fork may be BitcoinCash, Dash, EthereumClassic.&nbsp;<\/p>\n\n\n\n<p>The process of how to fork a cryptocurrency can be complex and requires careful consideration of various technical and practical factors, such as the consensus mechanism, mining algorithm, and governance structure.<\/p>\n\n\n\n<p>As far as the blockchain codes are open-sourced, anyone can <em>clone git repository<\/em> and build a similar blockchain environment. This approach is very common for <a href=\"https:\/\/blaize.tech\/blockchain-ecosystems\/\" target=\"_blank\" rel=\"noreferrer noopener\">custom blockchain development<\/a> which is aimed to empower the current business solution.&nbsp;&nbsp;<\/p>\n\n\n\n<p>Yet before we start describing the fundamental criteria for choosing a blockchain platform to fork, let’s define why you need to fork in the first place?&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">When do you need a fork?<\/h2>\n\n\n\n<p>Answering the question, making a fork of an existing solution is a good choice if you want to get the power of an already existing blockchain but make it more simple or adjust just a couple of your own custom features.&nbsp;<\/p>\n\n\n\n<p>In addition, blockchain forking is a popular decision if you want to get access to Ethereum EVM technology. To make such, one needs to fork Geth or Parity nodes and then further adjust it according to requirements.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><em><strong>Also making a fork of an existing blockchain fairly saves development costs, as far as the process is not that time-consuming in comparison to starting your own custom cryptocurrency from scratch.<\/strong>&nbsp;<\/em><\/p>\n\n\n\n<p>When thinking of any crypto payments adoption there is another important question that occurs: how to choose a blockchain platform to fork?&nbsp;<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Which is the best Blockchain platform to make a fork?<\/h2>\n\n\n\n<p>In Blaize we often use Bitcoin or Bitcoin-based as well as Ethereum-based blockchain technologies in order to create a custom cryptocurrency.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Bitcoin forks<\/strong><\/h2>\n\n\n\n<p>Bitcoin technology has the biggest amount of forks simply because it was the first sample of crypto payments. So everyone who wants to create cryptocurrency has at least taken a look at this code.&nbsp;<\/p>\n\n\n\n<p>If you want to create a new cryptocurrency that is based on the Bitcoin blockchain, you need to know how to fork Bitcoin. It&#8217;s important to understand the process and the technicalities involved, in order to create a successful fork that meets your needs.<\/p>\n\n\n\n<p>We suggest implementing Bitcoin technology in case your business case requires simple payments and ordinary system’s tasks. For the more complex solutions, we recommend considering other Bitcoin or Ethereum-based cryptocurrencies as a foundation to start your own cryptocurrency.&nbsp;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1400\" height=\"1057\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/05\/07DzfXb0cAIiFVwnu.png\" alt=\"create your own cryptocurrency by forking an existing blockchain\" class=\"wp-image-33154\"\/><\/figure>\n\n\n\n<h3 class=\"wp-block-heading\">Dash blockchain&nbsp;<\/h3>\n\n\n\n<p><a href=\"https:\/\/www.dash.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Dash<\/a> is a direct fork of Bitcoin but it has implemented numerous advantages to the initial technology. One of such is an enhancement to the Bitcoin consensus such as usage of X11 hashing algorithms for a low energy consuming PoW and adjustment of masterodes. The use of last allows for a wider list of operational features, for instance, <a href=\"https:\/\/blaize.tech\/decentralized-application\/\" target=\"_blank\" rel=\"noreferrer noopener\">DAO creation<\/a> for protocol governing.&nbsp;<\/p>\n\n\n\n<p>Also, masternodes are seen as a much secure solution. As far as one should deposit a considerable amount of native cryptocurrency to be able to process a node. This prevents the network from the attacks of potential malicious members.&nbsp;<\/p>\n\n\n\n<p>Dash uses InstantSend and PivateSend services to ensure secure and fast transactions. The protocol is easy upgradable and adaptable to the node software updates due to usage of SPORKs mechanism.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">PIVX blockchain<\/h3>\n\n\n\n<p><a href=\"https:\/\/pivx.org\/?hl=en\" target=\"_blank\" rel=\"noreferrer noopener\">PIVX<\/a> (Private Instant Verified Transactions) is a younger blockchain and represents a fork of Dash with a mix of additional adjustments taken from other solutions.&nbsp;<\/p>\n\n\n\n<p>PIVIX has taken Bitcoin wallet technology and format along with Dash masternode models. Yet, unlike traditional Bitcoin forks, PIVX uses a proof-of-stake consensus model to enhance transaction speed and blockchain operability.&nbsp;<\/p>\n\n\n\n<p>Thanks to the usage of SwiftX service PIVX also allows for instant and secure transactions along with adoption of SPORKs mechanism for the better upgradability of nodes.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Qtum blockchain<\/h3>\n\n\n\n<p><a href=\"https:\/\/qtum.org\/en\" target=\"_blank\" rel=\"noreferrer noopener\">Qtum<\/a> is a Bitcoin fork which supports Ethereum EVM and therefore enables smart contract creation. The DGP management integrated into Qtum system allows for adjusting of new blockchain settings with the help of smart contracts reducing the amount of hard forks.<\/p>\n\n\n\n<p>Unlike previous examples, Qtum uses neither masternodes nor DAO governing for protocol operation. It is based on PoS consensus which allows any user to stake and process a node. Furthermore, Qtum has a very large community that maintains the network, it takes third place after Bitcoin and Ethereum.<\/p>\n\n\n\n<p>Find out on <strong><a href=\"https:\/\/blaize.tech\/article-type\/ethereum-based-dapp-development-for-trading-platform\/\">how to develop a Ethereum dApp (with examples<\/a>)<\/strong>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Ethereum forks&nbsp;<\/strong><\/h2>\n\n\n\n<p>Ethereum blockchain is considered as another best technology to fork to start your own cryptocurrency. Mainly due to the possibility of Solidity smart contracts support.&nbsp;<\/p>\n\n\n\n<p>In terms of Ethereum blockchain forking, the best and commonly used practice is to fork Geth or Parity nodes. Then, to start your own cryptocurrency, you can customize it as you wish, add required features like custom wallet cryptography and implement the needed consensus model.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Quorum blockchain&nbsp;<\/h3>\n\n\n\n<p>Consensys <a href=\"https:\/\/consensys.net\/quorum\/enterprise\" target=\"_blank\" rel=\"noreferrer noopener\">Quorum<\/a> is the Ethereum-based blockchain fork of the <a href=\"https:\/\/geth.ethereum.org\/docs\/getting-started\" target=\"_blank\" rel=\"noreferrer noopener\">Geth node<\/a>. The main aim of Quorum creation is to enable successful <a href=\"https:\/\/blaize.tech\/article-type\/blockchain-adoption-to-contact-center-industry-qubicles-use-case\/\">blockchain adoption for businesses<\/a>.&nbsp;<\/p>\n\n\n\n<p>Unlike traditional Ethereum, Quorum blockchain does not base on PoW. It allows for several consensus models that are more suitable for permissioned consortium chains. It adopted PoA, Raft-based, and Istanbul BTF consensus models running.&nbsp;<\/p>\n\n\n\n<p>In advance, Quorum also runs its own services for additional transaction encryption. <a href=\"https:\/\/github.com\/ConsenSys\/quorum\" target=\"_blank\" rel=\"noreferrer noopener\">Tessera and Constellation<\/a> are in-built systems that allow for generating, encryption, decryption, and distribution of private transactions with additional self-management of all discovered nodes.&nbsp;<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\"><em><strong>In the case of Quorum you can see how the Ethereum blockchain fork can be changed and customized to the unique requirements like adjustment of a few consensus models while eliminating PoW. We can define Avalanche case as the other example of a  successful Ethereum fork implementation with further adoption to the network ecosystem.&nbsp;<\/strong><\/em><\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Avalanche network<\/h3>\n\n\n\n<p><a href=\"https:\/\/www.avalabs.org\/\" target=\"_blank\" rel=\"noreferrer noopener\">Avalanche<\/a> is one of the most prominent Ethereum forks while creating not just a single blockchain, but a heterogeneous blockchain protocol for hosting multiple blockchains.&nbsp;<\/p>\n\n\n\n<p>The Avalanche network is aiming to deal with the biggest Ethereum problem &#8211; scalability. The issue is solved due to stepping by the casual Ethereum PoW and using a new version of Proof-of-Stake consensus. The new model allows for an incredible level of finality (around 3 sec per transaction) and an unlimited amount of validators taking part in the consensus.&nbsp;<\/p>\n\n\n\n<p>In the case of Avalanche, the project adopted the full EVM toolkit from <a href=\"https:\/\/geth.ethereum.org\/docs\/getting-started\" target=\"_blank\" rel=\"noreferrer noopener\">Ethereum Geth node<\/a>, so such tools as MetaMask or Truffle are easily accessible. The PoS adoption enables a high-speeded smart contract creation and enormous throughput.&nbsp;Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/analysis\/how-to-develop-your-own-nft-platform-in-2023\/\">How to Create an NFT Platform<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Main points when choosing the best blockchain for forking<\/h2>\n\n\n\n<p>While choosing which blockchain to fork to start your own cryptocurrency, there are a few crucial points to pay attention to. Answering them will help to define which blockchain platform to choose for your <a href=\"https:\/\/blaize.tech\/blockchain-ecosystems\/\" target=\"_blank\" rel=\"noreferrer noopener\">custom cryptocurrency integration<\/a>.<\/p>\n\n\n\n<ol>\n<li><strong><em>Consensus model&nbsp;<\/em><\/strong><\/li>\n\n\n\n<li><strong><em>DAO<\/em><\/strong><\/li>\n\n\n\n<li><strong><em>Masternodes<\/em><\/strong><\/li>\n\n\n\n<li><strong><em>Smart contracts<\/em><\/strong><\/li>\n\n\n\n<li><strong><em>Private transaction services<\/em><\/strong><\/li>\n<\/ol>\n\n\n\n<p>Let&#8217;s take a look at each of them and define the network which fits the best to each of those requirements. <\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><span style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-primary-red-color\">Consensus model<\/span><\/h3>\n\n\n\n<p>Previously described blockchain used two types of consensus: PoW (Bitcoin, Dash) and PoS (PIVX, Qtum, Avalanche). This is one of the fundamental things you should choose while making a fork. PoS is considered being a faster and less costly solution as well as providing more energy efficiency.&nbsp;<\/p>\n\n\n\n<p>Though, you can spend additional efforts on development and adjust consensus to your needs. For example &#8211; change Ethereum PoW in Parity node to PoA(proof-of-authority) or PoS to speed up your system.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><span style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-primary-red-color\">DAO <\/span><\/h3>\n\n\n\n<p>The creation of DAO is crucial in terms of protocol governing. This is also time-consuming and costly if you decide to integrate it into the already existing solution. That is why, if you feel like your project will need a governing layer, it is better to keep an eye on the solutions that have this in-built feature (PIVX, Dash).&nbsp;By the way, check out our <strong><a href=\"https:\/\/blaize.tech\/blockchain-integration\/\">Blockchain integration services<\/a><\/strong>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><span style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-primary-red-color\">Masternodes <\/span><\/h3>\n\n\n\n<p>Masternodes empower protocol security and provide additional operational features. Moreover, it helps to create a greater incentive mechanism for network members.&nbsp;<\/p>\n\n\n\n<p>While making a fork, there is a possibility of adjusting masternodes to the client’s requirement and set all needed features (for instance establishing or eliminating masternode fees).&nbsp;&nbsp;So if your business model requires masternodes running consider PIVX or Dash fork implementation. <\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-blockchain-and-ai-convergence-empowers-your-business\/\">How Blockchain and AI Convergence Empower Your Business<\/a><\/strong>.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><span style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-primary-red-color\">Smart contracts <\/span><\/h3>\n\n\n\n<p>When you need to run smart contracts for your project it is better to utilize Qtum or make an Ethereum fork. You will get a reliable and verified solution within a short period of time.<\/p>\n\n\n\n<p>As you can see on the Avalanche example, forking and integration of EVM is fully possible as well as its adaptation to other <a href=\"https:\/\/blaize.tech\/article-type\/5-best-programming-languages-for-blockchain-development\/\">blockchain programming languages<\/a>. The same is applicable to WASM, x86 or similar virtual machines.&nbsp;Read: <strong><a href=\"https:\/\/blaize.tech\/article-type\/smart-contracts-with-blockchain-how-it-can-help-startups-be-more-cost-efficient\/\">Benefits of Smart Contracts<\/a><\/strong><\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><span style=\"background-color:rgba(0, 0, 0, 0)\" class=\"has-inline-color has-primary-red-color\">Private transaction services <\/span><\/h3>\n\n\n\n<p>The PrivateSend service from Dash allows for coin mixing which helps to make them untraceable and anonymous. The service mixes user’s coins with Dash coins in such a way that the real receiver address will never meet the authentic sender address. The maximum times of mixing is eight; the more rounds it does the more security your transaction gets.&nbsp;<\/p>\n\n\n\n<p>You can check for PIVX SwiftX and Quorum Tessera services as an alternative to PrivateSend. Thus, if you need to enable such a feature for your project, consider one of those forks implementations.<\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-to-develop-blockchain-based-lending-platform\/\">How to create lending platform based on blockchain<\/a><\/strong><\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Conclusion&nbsp;<\/strong><\/h2>\n\n\n\n<p>We have reviewed some of the well-known examples which can help you to start your own cryptocurrency and what is forking in the blockchain. Yet it is worth mentioning that you can take any open-sourced blockchain node, fork it, adjust features for your needs, and launch your own network. So you are not limited to the mentioned above ledgers and can fork any blockchain code: EOS, Polkadot, Tron, etc.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong><em>See how Blaize did a fork of EOS in <a href=\"https:\/\/blaize.tech\/clients\/remme\/\" target=\"_blank\" rel=\"noreferrer noopener\">Remme use case<\/a> and what <a href=\"https:\/\/blaize.tech\/article-type\/top-startups-on-polkadot-that-will-rock-in-2021\/\">top projects on polkadot<\/a> exist.<\/em><\/strong><\/h3>\n\n\n\n<p>In addition, you can check out our guide on <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-to-launch-a-project-on-polkadot-dapp-parachain-and-bridge\/\">how to create a project on Polkadot<\/a><\/strong>.<\/p>\n\n\n\n<p>While considering how to make your own blockchain or how to develop a new cryptocurrency Blaize experts recommend paying attention to the consensus type, availability of running smart contracts or masternodes and DAO.&nbsp;<\/p>\n\n\n\n<p class=\"has-text-align-center has-white-color has-primary-red-background-color has-text-color has-background\"><strong><em>Ready to make your own cryptocurrency? <a href=\"https:\/\/blaize.tech\/#contacts\" target=\"_blank\" rel=\"noreferrer noopener\">Contact Blaize<\/a><\/em><\/strong> experts for <strong><em>further discussion!<\/em><\/strong><\/p>\n\n\n\n<p>We are sure those recommendations will be a handful on the way to empowering your current business case with blockchain implementation, specifically with <strong><a href=\"https:\/\/blaize.tech\/for-enterprises\/\">blockchain development for your enterprise<\/a><\/strong>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Frequently asked questions<\/strong><\/h2>\n\n\n\n<ul>\n<li><strong>Why does forking happen in blockchain?<\/strong><\/li>\n<\/ul>\n\n\n\n<p>Forking occurs in blockchain when there&#8217;s a change in the consensus rules or network protocol. Reasons for forking may include updating network features, addressing security vulnerabilities, scaling the network, or creating a new cryptocurrency with different goals or values from the original chain.<\/p>\n\n\n\n<ul>\n<li><strong>What are the different types of blockchain forks?<\/strong><\/li>\n<\/ul>\n\n\n\n<p>There’re two main types of forks:<br>Soft Fork: A backward-compatible change, where updated nodes can still interact with non-updated nodes<\/p>\n\n\n\n<p>Hard Fork: A non-backward-compatible change, which results in a separate chain incompatible with the original<\/p>\n\n\n\n<ul>\n<li><strong>What are some best practices for forking a blockchain?<\/strong><\/li>\n<\/ul>\n\n\n\n<p>We recommend to consider the following point while planning to carry on a forking a blockchain:<br>Clearly define the purpose and goals of the fork<\/p>\n\n\n\n<p>Ensure thorough research and understanding of the original blockchain code<\/p>\n\n\n\n<p>Communicate the fork details to the community and relevant stakeholders<\/p>\n\n\n\n<p>Conduct extensive testing and audits to ensure the fork&#8217;s security and stability<\/p>\n\n\n\n<ul>\n<li><strong>What are some successful examples of blockchain forks?<\/strong><\/li>\n<\/ul>\n\n\n\n<p>Bitcoin Cash: A hard fork of Bitcoin aiming for larger block sizes to improve scalability<\/p>\n\n\n\n<p>Ethereum Classic: A result of a hard fork after the DAO hack, maintaining the original Ethereum chain<\/p>\n\n\n\n<p>Litecoin: A fork of Bitcoin with faster block times and a different hashing algorithm (Scrypt)<\/p>\n","protected":false},"excerpt":{"rendered":"<p>How many blockchain platforms are there? And which one serves the best for your project<a href=\"https:\/\/blaize.tech\/blog\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":358,"featured_media":3658,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[285,279,288,278],"tags":[445],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Fork a Blockchain to Start Your Own Cryptocurrency<\/title>\n<meta name=\"description\" content=\"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Fork a Blockchain to Start Your Own Cryptocurrency\" \/>\n<meta property=\"og:description\" content=\"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2021-01-04T13:11:17+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:07+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2021\/01\/blck-fork.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"630\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Maxim Shcherbina\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maxim Shcherbina\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\",\"url\":\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\",\"name\":\"How to Fork a Blockchain to Start Your Own Cryptocurrency\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2021-01-04T13:11:17+00:00\",\"dateModified\":\"2024-10-29T11:10:07+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829\"},\"description\":\"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Which Blockchain to Fork to Start Your Own Cryptocurrency\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829\",\"name\":\"Maxim Shcherbina\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png\",\"caption\":\"Maxim Shcherbina\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"How to Fork a Blockchain to Start Your Own Cryptocurrency","description":"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/","og_locale":"en_US","og_type":"article","og_title":"How to Fork a Blockchain to Start Your Own Cryptocurrency","og_description":"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.","og_url":"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/","og_site_name":"Blaize","article_published_time":"2021-01-04T13:11:17+00:00","article_modified_time":"2024-10-29T11:10:07+00:00","og_image":[{"width":1200,"height":630,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2021\/01\/blck-fork.png","type":"image\/png"}],"author":"Maxim Shcherbina","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Maxim Shcherbina","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/","url":"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/","name":"How to Fork a Blockchain to Start Your Own Cryptocurrency","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2021-01-04T13:11:17+00:00","dateModified":"2024-10-29T11:10:07+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829"},"description":"We want to turn your attention to the question of how to start your own cryptocurrency by forking an existing blockchain.","breadcrumb":{"@id":"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/article-type\/which-blockchain-to-fork-to-start-your-own-cryptocurrency\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Which Blockchain to Fork to Start Your Own Cryptocurrency"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829","name":"Maxim Shcherbina","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png","caption":"Maxim Shcherbina"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3657"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/358"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=3657"}],"version-history":[{"count":22,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3657\/revisions"}],"predecessor-version":[{"id":61684,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/3657\/revisions\/61684"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/3658"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=3657"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=3657"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=3657"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}