{"id":36888,"date":"2023-07-06T08:00:36","date_gmt":"2023-07-06T08:00:36","guid":{"rendered":"https:\/\/2E288B57-2FCD-4B16-B22F-16107F94F84E"},"modified":"2024-10-31T13:47:04","modified_gmt":"2024-10-31T13:47:04","slug":"embracing-blockchain-for-carbon-credits-and-green-tech","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/","title":{"rendered":"Embracing Blockchain For Carbon Credits and Green Tech"},"content":{"rendered":"\n<p>In an era where sustainable living is crucial, the integration of green tech and blockchain in carbon credits has emerged as a game-changing combination. Carbon credits are permits allowing companies to emit specific amounts of greenhouse gases, which are offset by investing in green tech projects that reduce or capture equivalent emissions.<\/p>\n\n\n\n<p>As of 2023, the global carbon market is a booming $300 billion industry. This growth is fueled by increasing awareness, regulatory pressures, and the infusion of green tech and blockchain, which bring efficiency and transparency to carbon trading. The European Union’s Emissions Trading System is the world’s largest and catalyzes global participation in carbon trading through green tech and blockchain.<\/p>\n\n\n\n<p>Companies participating in the carbon credits market comply with regulations and contribute to environmental sustainability. The marriage of green tech with blockchain ensures that carbon credits investments are directed to viable projects, while blockchain brings verifiability, transparency, and security to transactions.<\/p>\n\n\n\n<p>Pioneering companies like Toucan, Nori, and dClimate are leveraging blockchain for green tech to revolutionize the carbon credits market. This integration ensures carbon credits are not just accounting tools, but cornerstones for a tangible, greener future.<\/p>\n\n\n\n<p>In summary, the integration of green tech and blockchain in carbon credits is an exemplary innovation that drives meaningful environmental change. As climate change challenges mount, such integrations ensure sustainability remains a priority in corporate responsibility and global progress.<\/p>\n\n\n\n<p class=\"has-white-color has-primary-red-background-color has-text-color has-background\">Web3 technologies become an integral part of business and enterprise operations. <a href=\"https:\/\/blaize.tech\/services\/blockchain-integration\/why-web3-is-what-enterprise-and-business-really-need\/\">Learn more<\/a> about the reasons for such a process in Blaize&#8217;s latest article.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What Can Blockchain Do in Carbon Credits Market<\/h2>\n\n\n\n<p>Integrating blockchain technology into the carbon credits realm is a promising venture. Blockchain offers transparency, efficiency, and security, which are vital in managing carbon credits data and transactions. Companies like Toucan, Nori, and dClimate are making waves by leveraging blockchain to transform the carbon credits market.<\/p>\n\n\n\n<p>With its inherent features, blockchain technology holds transformative potential for the carbon credits market. Below are the key aspects through which blockchain can revamp and streamline the carbon credits ecosystem:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Asset Tokenization<\/strong><\/h3>\n\n\n\n<p>Asset tokenization involves the digital representation of physical assets, such as carbon credits, on a blockchain. By tokenizing carbon credits, blockchain enhances their liquidity and enables a more transparent and efficient trading process. This essentially democratizes the carbon market, allowing smaller entities to participate, and ensures that credits are accurately represented and cannot be double-counted.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Digitizing Data (Open Data Infrastructure)<\/strong><\/h3>\n\n\n\n<p>Data integrity is crucial for the credibility of the carbon credits market. With its immutable and transparent nature, blockchain ensures that emission data is accurately recorded and verifiable. Moreover, through a decentralized open data infrastructure, blockchain enables seamless data sharing among different stakeholders, thus promoting collaboration and informed decision-making.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Efficient Carbon Offset Trading<\/strong><\/h3>\n\n\n\n<p>Blockchain streamlines the trading of carbon offsets by eliminating intermediaries and reducing transaction times. Furthermore, smart contracts – self-executing contracts with the terms directly written into code – enable automation in trading. This can include automated validation, settlement, and transfer of carbon credits, leading to cost savings and reduced chances of human errors. Hence, carbon offset trading with blockchain becomes very close to DeFi and adopts all advantages of modern decentralized trading instruments and their derivatives.<\/p>\n\n\n\n<p>Feel free to <a href=\"https:\/\/blaize.tech\/clients\/defi-asset-management-platform-development-for-dehive\/\">discover<\/a> Blaize&#8217;s expertise in developing DeFi-based projects, for example, DeHive.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Enhanced Accountability and Traceability<\/strong><\/h3>\n\n\n\n<p>For carbon credits to be effective, it is essential that projects reducing emissions are legitimate and that their impact can be traced. Blockchain provides an auditable and tamper-proof record of carbon reduction projects. This enhanced accountability and traceability increase participant trust and can attract more investments into the carbon credits market.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Cross-border Collaboration<\/strong><\/h3>\n\n\n\n<p>Often, carbon credit projects involve stakeholders from different parts of the world. Blockchain facilitates cross-border collaboration by providing a common platform that is not bound by traditional banking or governmental limitations. This enhances the global reach and impact of carbon credit initiatives.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Fraud Reduction<\/strong><\/h3>\n\n\n\n<p>Fraud and inaccuracies can undermine the carbon credits market. Blockchain’s immutability means that it cannot be altered without consensus once data is recorded. This significantly reduces the possibility of fraudulent activity within the carbon credits market.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Successful Application of Blockchain for Carbon Credits Industry<\/h2>\n\n\n\n<p>Blockchain technology revolutionizes the carbon credits market by bringing transparency, efficiency, and security. Let&#8217;s take a closer look at some real-world use cases:<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Sunified<\/strong><\/h3>\n\n\n\n<p><a href=\"https:\/\/www.sunified.com\/\">Sunified<\/a> is focused on leveraging blockchain to facilitate investments in solar energy projects. Using blockchain, Sunified can accurately track and verify renewable energy production. Investors can buy and lease solar cells to solar projects, earning a share of the revenue generated. With blockchain, the ownership of solar cells and the flow of revenue are transparent and secure. Sunified aims to democratize investments in renewable energy, offering returns to investors and significantly contributing to reducing carbon emissions.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>KlimaDAO<\/strong><\/h3>\n\n\n\n<p>KlimaDAO uses blockchain to create a decentralized autonomous organization focused on purchasing and locking up carbon credits to reduce the global carbon footprint. KlimaDAO utilizes a native crypto token that is backed by carbon credits. Through this system, individuals can purchase tokens, indirectly acquire carbon credits, and contribute to environmental sustainability. As of late 2022, KlimaDAO reportedly locked away carbon credits equivalent to over 1 million tonnes of CO2. This DAO is actively making a significant impact in combating climate change through blockchain.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>dClimate.net<\/strong><\/h3>\n\n\n\n<p><a href=\"https:\/\/www.dclimate.net\/\">dClimate<\/a> is a blockchain-based platform that connects climate data producers with data consumers, ensuring transparency and accessibility to high-quality climate information. Using blockchain, dClimate establishes trust among stakeholders and provides immutable, verifiable data essential for climate-related projects, including carbon credits. dClimate also uses a native cryptocurrency token to incentivize data sharing and consumption.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Poseidon Foundation<\/strong><\/h3>\n\n\n\n<p>Poseidon Foundation is utilizing blockchain for carbon offset in retail environments. Consumers can contribute to carbon credits through their platform by making retail purchases. Poseidon&#8217;s platform calculates the carbon footprint of each purchase and offers the consumer an opportunity to offset that by contributing to forest conservation projects. Poseidon’s blockchain tracks these contributions and the resulting carbon credits, offering transparency and verifiability.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>Indonesia x Metaverse Green Exchange<\/strong><\/h3>\n\n\n\n<p>In an unprecedented move, the Indonesian government partnered with the <a href=\"https:\/\/www.mvgx.com\/about\/\">Metaverse Green Exchange<\/a> to launch a blockchain-based carbon trading platform. This platform allows carbon credits generated in Indonesia to be traded internationally. It aims to drive investments in green projects in Indonesia, which is home to a significant portion of the world’s rainforests and peatlands, crucial in carbon sequestration.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\"><strong>WWF x BCG Digital Ventures<\/strong><\/h3>\n\n\n\n<p>The World Wildlife Fund (WWF) partnered with <a href=\"https:\/\/bcgdv.com\/our-work\/opensc\/\">BCG Digital Ventures<\/a> to launch OpenSC, a blockchain-based platform to track the environmental impact of products. OpenSC enables businesses and consumers to view and understand the carbon footprint of the products they produce or purchase. By providing this information transparently through blockchain, OpenSC empowers more sustainable production and consumption patterns.<\/p>\n\n\n\n<p>These products demonstrate how blockchain technology is a game-changer in the carbon credits market. By ensuring transparency, efficiency, and security, blockchain empowers various stakeholders to actively contribute to environmental sustainability while also participating in a growing and increasingly important market.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Blaize Expertise<\/h2>\n\n\n\n<p>Blaize, one of the largest players in the blockchain development world, is ideally positioned to help your business harness blockchain for carbon credits. With a proven track record in delivering cutting-edge blockchain solutions, Blaize’s expertise covers a lot of industries. The green tech and green energy segment are one of the industries where Blaize engineers feel comfortable as well. Our team can offer various options of web3 technology integration for green tech businesses and enterprises: decentralized storage integration, energy flow tracking from the power stations, tokenization of energy produced, decentralized market for green technologies, integration of cutting-edge web3 technologies, and a lot more. And of course, Blaize can empower your business to integrate carbon blockchain technology seamlessly, ensuring compliance with emission standards, enhancing data integrity, and driving sustainable growth.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ways Blockchain Reduces Carbon Emissions<\/h2>\n\n\n\n<p>Blockchain technology, renowned for its transparency, immutability, and security, can significantly reduce carbon emissions. Let’s delve into the critical avenues through which blockchain facilitates carbon emission reduction:<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><strong>Ways Blockchain Reduces Carbon Emissions:<\/strong><\/td><td><strong>Description:<\/strong><\/td><td><strong>Examples:<\/strong><\/td><\/tr><tr><td>Streamlined Carbon Credits Management<\/td><td>Blockchain provides a transparent and secure platform for managing and trading carbon credits. By tokenizing credits enables efficient trading and encourages participation in carbon offset projects.<\/td><td>Nori, IBM Blockchain<\/td><\/tr><tr><td>Supply Chain Efficiency<\/td><td>Blockchain allows companies to monitor the carbon footprint of their supply chains transparently. This helps in identifying and eliminating wasteful practices, leading to reduced emissions.<\/td><td>Provenance, VeChain<\/td><\/tr><tr><td>Facilitating Renewable Energy Trading<\/td><td>Blockchain facilitates peer-to-peer renewable energy trading, allowing producers to sell directly to consumers. This reduces inefficiencies and emissions linked to traditional energy distribution.<\/td><td>LO3 Energy, Power Ledger<\/td><\/tr><tr><td>Real-time Emissions Monitoring<\/td><td>Through integration with IoT, blockchain enables real-time recording and tracking of greenhouse gas emissions. This allows for data-driven and effective emission reduction strategies.<\/td><td>Chainlink<\/td><\/tr><tr><td>Cryptocurrency Incentives<\/td><td>Blockchain platforms can incentivize eco-friendly practices by offering cryptocurrency rewards. Users can earn tokens for reducing carbon footprints and encouraging sustainable behavior.<\/td><td>Energy Web, SolarCoin<\/td><\/tr><tr><td>Transparency in Offset Projects<\/td><td>Blockchain ensures transparency in environmental projects by recording immutable data on fund usage and environmental impact, leading to greater investment and effectiveness in carbon offset projects.<\/td><td>CarbonX, Earth Dollar<\/td><\/tr><tr><td>Automated Compliance via Smart Contracts<\/td><td>Smart contracts on the blockchain can automate regulatory compliance, such as purchasing carbon offsets or imposing fines for exceeding emission limits, thus promoting responsible environmental practices.<\/td><td>DAO IPCI, MyCO2<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>A blockchain is a multifaceted tool for combating climate change by streamlining carbon credit management, optimizing supply chains, facilitating renewable energy trading, enabling real-time emissions tracking, incentivizing sustainability, ensuring transparency, and automating compliance.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Conclusion<\/h2>\n\n\n\n<p>As the world faces the escalating challenges of climate change, it is imperative to leverage innovative technologies to foster sustainable practices. Blockchain technology emerges as a transformative force in this landscape, capable of revolutionizing green tech, revamping the carbon credits market, and significantly contributing to carbon emission reduction.<\/p>\n\n\n\n<p>Blockchain addresses critical issues in the carbon market, such as fraud, inefficiencies, and lack of trust. It empowers the tokenization of carbon credits, streamlines trading, and facilitates the seamless integration of data from various sources, thus enabling informed decision-making and effective climate action strategies. Blockchain tech makes the green energy industry even more efficient and eco-friendly.<\/p>\n\n\n\n<p>Moreover, the integration of blockchain within supply chains, renewable energy sectors, and carbon offset projects manifests as an efficiency driver and an enabler of transparent and verifiable sustainability practices. This transparency is crucial for building trust among stakeholders, attracting investments, and ensuring the long-term viability of environmental projects.<\/p>\n\n\n\n<p>Prominent use cases, such as Sunified, KlimaDAO, and dClimate, exemplify how blockchain can be pragmatically applied to achieve tangible impacts in carbon reduction and environmental conservation. Moreover, the commitment and support demonstrated by government bodies, notably the European Union, through strategic partnerships, financial support, and policy frameworks fortify the position of blockchain as an instrumental technology for climate action.<\/p>\n\n\n\n<p class=\"has-white-color has-light-gray-background-color has-text-color has-background\">Blaize, with its expertise in blockchain development and a vision for a sustainable future, stands at the forefront of this technological revolution. By partnering with Blaize, businesses can harness the immense potential of blockchain to not only thrive in the carbon credits market but also contribute substantially to the green tech industry and collective mission of mitigating climate change and securing a sustainable future for generations to come. Blaize mastered the process of <a href=\"https:\/\/blaize.tech\/for-enterprises\/\">integration of web3 into web2<\/a> and knows how to make your business more efficient using blockchain technologies.<\/p>\n\n\n\n<p>In the epoch of climate consciousness, blockchain technology is not just an innovation but an indispensable catalyst for positive environmental transformation.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In an era where sustainable living is crucial, the integration of green tech and blockchain<a href=\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":342,"featured_media":36892,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[284,289,288],"tags":[312,332,440],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Blockchain for Carbon Credits &amp; Green Tech with Blaize<\/title>\n<meta name=\"description\" content=\"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain for Carbon Credits &amp; Green Tech with Blaize\" \/>\n<meta property=\"og:description\" content=\"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2023-07-06T08:00:36+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-31T13:47:04+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/07\/Frame-59876-1.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"675\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Sergey Onyshchenko\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@S_Onishchenko\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sergey Onyshchenko\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\",\"url\":\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\",\"name\":\"Blockchain for Carbon Credits & Green Tech with Blaize\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2023-07-06T08:00:36+00:00\",\"dateModified\":\"2024-10-31T13:47:04+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\"},\"description\":\"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Embracing Blockchain For Carbon Credits and Green Tech\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\",\"name\":\"Sergey Onyshchenko\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"caption\":\"Sergey Onyshchenko\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/sergeyonishenko\/\",\"https:\/\/twitter.com\/S_Onishchenko\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Blockchain for Carbon Credits & Green Tech with Blaize","description":"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/","og_locale":"en_US","og_type":"article","og_title":"Blockchain for Carbon Credits & Green Tech with Blaize","og_description":"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.","og_url":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/","og_site_name":"Blaize","article_published_time":"2023-07-06T08:00:36+00:00","article_modified_time":"2024-10-31T13:47:04+00:00","og_image":[{"width":1200,"height":675,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2023\/07\/Frame-59876-1.png","type":"image\/png"}],"author":"Sergey Onyshchenko","twitter_card":"summary_large_image","twitter_creator":"@S_Onishchenko","twitter_misc":{"Written by":"Sergey Onyshchenko","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/","url":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/","name":"Blockchain for Carbon Credits & Green Tech with Blaize","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2023-07-06T08:00:36+00:00","dateModified":"2024-10-31T13:47:04+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670"},"description":"Explore how blockchain revolutionizes the green tech and carbon credits market and why Blaize is your ideal partner.","breadcrumb":{"@id":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/blog\/embracing-blockchain-for-carbon-credits-and-green-tech\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Embracing Blockchain For Carbon Credits and Green Tech"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670","name":"Sergey Onyshchenko","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","caption":"Sergey Onyshchenko"},"sameAs":["https:\/\/www.linkedin.com\/in\/sergeyonishenko\/","https:\/\/twitter.com\/S_Onishchenko"]}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/36888"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/342"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=36888"}],"version-history":[{"count":6,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/36888\/revisions"}],"predecessor-version":[{"id":71050,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/36888\/revisions\/71050"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/36892"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=36888"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=36888"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=36888"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}