{"id":60892,"date":"2024-06-07T14:53:12","date_gmt":"2024-06-07T14:53:12","guid":{"rendered":"https:\/\/blaize.tech\/?p=60892"},"modified":"2024-10-29T11:09:46","modified_gmt":"2024-10-29T11:09:46","slug":"what-is-desci","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/what-is-desci\/","title":{"rendered":"What is DeSci: The Revolution of Decentralized Science"},"content":{"rendered":"\n<p>In an era defined by rapid technological advancements and an increasing demand for transparency and collaboration, traditional models of scientific research are undergoing significant scrutiny and evolution. This transformation is reflected by the rise of <strong>Decentralized Science (DeSci)<\/strong> &#8211; an innovative approach that joints the principles of decentralization with the meticulousness of scientific inquiry. <\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"628\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/2-4.webp\" alt=\"The appeal of DeSci lies in its potential to radically alter how scientific data is created, shared, and validated\" class=\"wp-image-60893\"\/><\/figure>\n\n\n\n<p>As the hashtag #DeSci gains traction on platforms like X (formerly Twitter), and as major players in the Web3 arena like Binance spotlight this topic in their communications, it&#8217;s clear that DeSci is not just a niche interest but a burgeoning field with substantial backing.<\/p>\n\n\n\n<p>The appeal of DeSci lies in its potential to radically alter how scientific data is created, shared, and validated. There has been a significant increase in blockchain applications for scientific research, with over 150 active DeSci projects reported as of 2024, attracting upwards of $200 million in funding from both institutional and community sources. This surge in interest and investment underscores the growing recognition of DeSci&#8217;s capability to enhance the efficiency, accessibility, and integrity of scientific endeavors.<\/p>\n\n\n\n<p>So to draw your absolute attention to the topic, let us share with you <strong>Vitalik Buterin’s (Ethereum)<\/strong> quote from the podcast devoted to DeSci, underscoring its transformative potential:<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>&#8220;<em>I guess I view decentralized science as a collection of ideas that basically have to do with trying to answer the question of what are some ways in which emerging open and decentralized technologies can make us, science better and can improve the institutions of science, in a broad sense, can improve mental health, people who are just excited to collaborate with each other and get things out to the broader public.<\/em>&#8220;<\/p>\n<\/blockquote>\n\n\n\n<p>By leveraging the foundational technologies of blockchain and Web3, DeSci endeavors to democratize access to scientific data, ensuring that knowledge creation and dissemination are no longer confined to the walls of elite institutions. This article delves into the essence of Decentralized Science, explores its core technical mechanisms, and discusses its potential to reshape the landscape of global research and development.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">What is DeSci?<\/h2>\n\n\n\n<p>Decentralized Science represents a transformative approach to scientific research and collaboration, utilizing the principles of blockchain and Web3 technologies to challenge and restructure traditional scientific paradigms. This innovative field aims to democratize the processes of scientific discovery, knowledge dissemination, and intellectual property management, making them more accessible, transparent, and collaborative.<\/p>\n\n\n\n<p>Let’s together take a closer look at some of the concept’s definitions made by several reputable sources, to understand the common features of the topic as well as realize its potential highlighted by the leaders of the industries:<\/p>\n\n\n\n<p><strong>Binance<\/strong>: &#8220;<em>Essentially, DeSci aims to broaden access to scientific data, promote more transparent peer review processes, and incentivize international collaboration among researchers. By leveraging blockchain technology, DeSci can ensure the integrity and immutability of scientific records while eliminating barriers to entry.<\/em>&#8220;<\/p>\n\n\n\n<p><strong>Ethereum<\/strong>: &#8220;<em>Decentralized science (DeSci) is a movement that aims to build public infrastructure for funding, creating, reviewing, crediting, storing, and disseminating scientific knowledge fairly and equitably using the Web3 stack. DeSci aims to create an ecosystem where scientists are incentivized to openly share their research and receive credit for their work while allowing anyone to access and contribute to the research easily.<\/em>&#8220;<\/p>\n\n\n\n<p><strong>Stanford Law School<\/strong>: &#8220;<em>Some of the biggest problems that science, as an institution, is experiencing in the 21st Century, are funding, the organization of science, and the need for greater transparency during the scientific process. From a funding perspective, funding for basic research and translational research is a challenge, as well as obtaining funding to commercialize intellectual property ownership over new inventions and research data. From an organizational and transparency perspective, the peer review process of the publication of research, access to research data and methods, communication and collaboration between researchers, and reproducibility and replicability of research results are causing challenges in the scientific community. DeSci can be applied across these problems to provide a decentralized platform for the funding, organization, and openness of science.<\/em>&#8220;<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"2400\" height=\"2268\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4.webp\" alt=\"Decentralized Science concept's potential is highlighted by the leaders of the industries.\" class=\"wp-image-60897\" srcset=\"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4.webp 2400w, https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4-1536x1452.webp 1536w, https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4-2048x1935.webp 2048w, https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4-1568x1482.webp 1568w, https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/3-4-24x24.webp 24w\" sizes=\"(max-width: 2400px) 100vw, 2400px\" \/><\/figure>\n\n\n\n<p>DeSci is fundamentally about shifting control from centralized entities such as academic publishers and research institutions to a more dispersed and inclusive model. This shift is facilitated by several key technologies and methodologies inherent to blockchain and web3:<\/p>\n\n\n\n<ul>\n<li><strong>Transparency<\/strong>: Every transaction or data entry on a blockchain is recorded in a way that is immutable and auditable by all participants, which significantly increases the transparency of research processes and outcomes.<\/li>\n\n\n\n<li><strong>Collaboration<\/strong>: By using decentralized platforms, scientists around the world can collaborate without the need for intermediaries, which reduces barriers to entry and accelerates the pace of innovation.<\/li>\n\n\n\n<li><strong>Incentivization<\/strong>: Through mechanisms such as IP-NFTs (<em>IP-NFTs digitize intellectual property by bridging it on-chain. IP-NFTs form a bridge between real-world intellectual property legal contracts and the blockchain, empowering scientists to embrace a new source of funding for their research and a new means for transacting on their discoveries.<\/em>), researchers can be directly rewarded for their contributions, which can change the dynamics of funding and recognition in the scientific community.<\/li>\n<\/ul>\n\n\n\n<p>By integrating these elements, DeSci is not only redefining how scientific data is handled but also who gets to participate in the scientific discourse. This broader inclusion coupled with enhanced security and transparency mechanisms could potentially lead to a more robust and innovative scientific community globally.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Core Tenets of DeSci: How It Works Technically<\/h2>\n\n\n\n<p>Decentralized Science is underpinned by a suite of technical components that collectively enhance the integrity, accessibility, and efficiency of scientific research. These components are crucial in overcoming traditional barriers and are central to DeSci’s operational framework. Below, we delve into each of these core technical tenets, providing examples where applicable.<\/p>\n\n\n\n<figure class=\"wp-block-image size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1200\" height=\"628\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/rocket.webp\" alt=\"DeSci offers a range of benefits that could potentially revolutionize the scientific research landscape.\" class=\"wp-image-60896\"\/><\/figure>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Blockchain for Secure Data Storage<\/strong><\/h4>\n\n\n\n<p>At the heart of DeSci is blockchain technology, which provides a decentralized ledger for recording transactions and data in a verifiable and permanent manner. This technology is instrumental in managing scientific data, ensuring it remains immutable and transparent. For instance, a DeSci project might use a blockchain to log experimental data directly from laboratory instruments, ensuring that the data cannot be altered after recording. This would be crucial in clinical trials or in environmental data analysis, where data integrity is paramount.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>DAOs<\/strong><\/h4>\n\n\n\n<p>DAOs are organizational structures that run on rules encoded as computer programs called smart contracts. In DeSci, DAOs are used to democratize the governance of scientific projects. Members of a DeSci DAO can vote on various issues such as the direction of research, allocation of funds, and publication of results, without the need for a central authority. An example is the VitaDAO, which focuses on funding longevity research. Researchers submit proposals to the DAO, and token holders vote to decide which projects receive funding.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Intellectual Property Non-Fungible Tokens (IP-NFTs)<\/strong><\/h4>\n\n\n\n<p>IP-NFTs represent a novel method for recognizing and rewarding scientific contributions. They can be used to assign and verify ownership and rights to scientific discoveries and data. By tokenizing intellectual property, researchers can ensure that they retain ownership rights over their contributions, which can then be licensed or sold. For example, a researcher could tokenize the formula of a newly discovered compound, and then sell or license this NFT to pharmaceutical companies for development.<\/p>\n\n\n\n<h4 class=\"wp-block-heading\"><strong>Decentralized Storage<\/strong><\/h4>\n\n\n\n<p>In the realm of DeSci, decentralized storage plays a crucial role in maintaining the integrity and accessibility of data across a distributed network. Unlike traditional data storage solutions that rely on centralized servers, decentralized storage systems like IPFS, Filecoin, and others, allow for the secure and efficient storage of large datasets. These platforms are especially valuable in fields requiring robust data security and accessibility, such as genomic research and environmental monitoring. By leveraging a network of peer-to-peer nodes, these decentralized storage solutions ensure that scientific data remains available and resilient against localized failures or censorship, promoting greater scientific collaboration and data longevity.<\/p>\n\n\n\n<p>These core technical components of DeSci not only ensure the technical feasibility of decentralized science but also promise a transformative impact on how scientific collaboration and innovation occur across the globe.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Potential Benefits of DeSci: How It Boosts Science<\/h2>\n\n\n\n<p>DeSci offers a range of benefits that could potentially revolutionize the scientific research landscape. Each benefit not only addresses a specific limitation of the traditional scientific process but also enhances the overall efficacy and integrity of scientific exploration. Below is a detailed table outlining these benefits, accompanied by real-life examples that demonstrate their practical application.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><strong>Benefit<\/strong><\/td><td><strong>Description<\/strong><\/td><td><strong>Real-Life Example<\/strong><\/td><\/tr><tr><td>Increased Transparency<\/td><td>DeSci mechanisms ensure that all modifications, contributions, and results are recorded on a blockchain, making the entire research process transparent and auditable.<\/td><td>In environmental research, platforms like OpenEarth Foundation use blockchain to record and verify environmental data, ensuring it remains tamper-proof and accessible for review.<\/td><\/tr><tr><td>Improved Accessibility<\/td><td>By eliminating geographic and institutional barriers, DeSci facilitates a more inclusive research environment where anyone can participate regardless of location or affiliation.<\/td><td>The Polymath Network uses blockchain to simplify and democratize the process of scientific publishing, allowing researchers worldwide to publish and access scientific papers.<\/td><\/tr><tr><td>Enhanced Collaboration<\/td><td>DAOs and smart contracts in DeSci enable scientists to collaborate directly and efficiently by reducing bureaucratic overhead and facilitating seamless peer-to-peer interactions.<\/td><td>ResearchHub is an example where researchers collaborate on projects, peer review, and share data using a DAO structure, enhancing collaborative efforts across disciplines.<\/td><\/tr><tr><td>Efficient Funding Models<\/td><td>Blockchain enables streamlined, transparent funding models that ensure equitable distribution of resources and direct funding to researchers based on community votes or preset criteria.<\/td><td>VitaDAO funds longevity research projects chosen by its community through token-based voting, demonstrating a direct, democratic approach to allocating research funding.<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>These benefits collectively contribute to a more robust and dynamic scientific community, where the focus shifts from individual gain to collective advancement and knowledge sharing. The use of blockchain and related technologies in DeSci not only solves several problems associated with traditional scientific practices but also opens up new avenues for global collaboration and innovation.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Decentralized Science Use Cases<\/h2>\n\n\n\n<p>DeSci is making significant inroads into various scientific fields by leveraging blockchain technology to enhance transparency, accessibility, and collaboration. Below, we explore how DeSci principles are applied in specific areas within science, highlighting the transformative potential of these applications.<\/p>\n\n\n\n<figure class=\"wp-block-table\"><table><tbody><tr><td><strong>Scientific Area<\/strong><\/td><td><strong>Impact of DeSci<\/strong><\/td><td><strong>Example Application<\/strong><\/td><\/tr><tr><td>Academic Publishing<\/td><td>DeSci reduces barriers to accessing scientific research by eliminating paywalls and streamlining the publication process. It also fosters a more transparent and timely peer review process.<\/td><td>Orvium: Utilizes blockchain to handle the submission, review, publishing, and dissemination of scientific papers, ensuring that scientific works are immediately available and accessible.<\/td><\/tr><tr><td>Research Funding<\/td><td>By using blockchain, DeSci introduces transparent and democratic funding models where the allocation of resources is determined by community voting or automated smart contracts, reducing bias and improving funding accessibility.<\/td><td>Scienceroot: Employs a blockchain-based economy to fund scientific research. Researchers present their projects directly to the community, which then uses tokens to vote on funding allocation.<\/td><\/tr><tr><td>Data Sharing<\/td><td>DeSci ensures that scientific data is shared securely and efficiently, with blockchain providing a platform for verifying the authenticity and integrity of shared data, thus enhancing collaborative research across borders.<\/td><td>Ocean Protocol: Offers a decentralized data exchange platform that enables secure sharing, selling, and accessing of datasets, fostering collaboration while maintaining data privacy.<\/td><\/tr><tr><td>Peer Review<\/td><td>DeSci can revamp the traditional peer review process by making it more transparent, accountable, and bias-free. Reviews and reviewer identities can be verified without compromising anonymity, improving the quality and reliability of published research.<\/td><td>Decentralized Science: Implements blockchain to facilitate a transparent and accountable peer review process where reviews are publicly verifiable and reviewers are compensated fairly.<\/td><\/tr><tr><td>Clinical Trials<\/td><td>DeSci can significantly enhance the transparency and reliability of clinical trials by securely recording and tracking all trial data on a blockchain. This ensures that data cannot be tampered with post-hoc, thus improving the validity of trial outcomes.<\/td><td>ClinTex CTi: Leverages blockchain to enhance data integrity, manage clinical trial data, and ensure regulatory compliance more efficiently, thereby reducing costs and improving trust in trial results.<\/td><\/tr><\/tbody><\/table><\/figure>\n\n\n\n<p>These use cases demonstrate that DeSci is not merely a theoretical concept but a practical innovation with diverse applications across the scientific spectrum. By implementing DeSci principles, the scientific community can achieve greater efficiency, accountability, and inclusivity, ultimately accelerating the pace of global scientific advancement.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Overview of DeSci Projects<\/h2>\n\n\n\n<p>The burgeoning field of Decentralized Science is brimming with innovative projects that are reimagining the landscape of scientific research. By leveraging the power of blockchain technology, DeSci initiatives aim to foster a more open, collaborative, and democratized approach to scientific discovery. This section delves into three of the most popular DeSci projects, showcasing the immense potential and diverse applications within this exciting domain.<\/p>\n\n\n\n<p><strong>1. Numerai (NMR): Crowdsourced Financial Modeling for Science<\/strong><\/p>\n\n\n\n<p>Numerai tackles a unique challenge in scientific research: the need for accurate and reliable data for financial modeling in fields like drug discovery and climate change. The platform utilizes a gamified approach where data scientists compete to build the most accurate models using anonymized datasets. NMR, the platform&#8217;s token, incentivizes participation and rewards data scientists for their contributions. This innovative approach leverages the collective intelligence of the crowd to generate valuable datasets for scientific research, ultimately accelerating progress in critical fields.<\/p>\n\n\n\n<p><strong>2. SciDAO (SCIDAO): Democratizing Scientific Publishing<\/strong><\/p>\n\n\n\n<p>The traditional scientific publishing model is often criticized for being slow, expensive, and prone to gatekeeping. SciDAO aims to revolutionize scientific publishing by creating a decentralized, open-access platform. Researchers can publish their work on the platform without the need for traditional publishers. The platform utilizes a community-driven review process, where reviewers are incentivized with SCIDAO tokens for their contributions. This approach promotes transparency and democratizes access to scientific knowledge, potentially leading to faster dissemination of research findings.<\/p>\n\n\n\n<p><strong>3. Ricochet (XEC): Secure and Incentivized Whistle-Blowing in Science<\/strong><\/p>\n\n\n\n<p>These three projects represent just a fraction of the vibrant DeSci ecosystem. The diversity of these initiatives highlights the immense potential of DeSci to revolutionize scientific research across various disciplines. From facilitating collaborative drug discovery to democratizing scientific publishing and promoting research integrity, DeSci is poised to usher in a new era of scientific discovery.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Final Thoughts<\/h2>\n\n\n\n<p>DeSci has emerged as a significant force in redefining traditional scientific research paradigms. While the current landscape of DeSci is marked by a surge of innovative projects and growing adoption, several challenges remain. Issues such as the scalability of blockchain technologies, interoperability between different decentralized systems, and the widespread adoption by the conventional scientific community continue to pose hurdles. Moreover, regulatory and ethical considerations in how data is managed and shared on decentralized platforms are also critical areas that require thoughtful deliberation and strategic solutions.<\/p>\n\n\n\n<p>Despite these challenges, the future potential of DeSci is substantial. By harnessing the power of blockchain and Web3 technologies, DeSci has the capability to transform scientific research into a more transparent, accessible, and collaborative process. The implications for scientific discovery are profound &#8211; accelerating the pace of innovation, reducing barriers to entry for researchers globally, and fostering a more equitable distribution of resources.<\/p>\n\n\n\n<blockquote class=\"wp-block-quote\">\n<p>In the words of Serhii Onyshchenko, CEO &amp; Co-founder of Blaize:<\/p>\n\n\n\n<p>&#8220;<em>Decentralized science is not just a technological shift but a cultural revolution in research. It represents a leap towards a future where knowledge is unbound and collaboratively nurtured, promising unprecedented advancements across all fields of science<\/em>.&#8221;<\/p>\n<\/blockquote>\n\n\n\n<p>The trajectory of DeSci suggests a future where the collective intelligence of the global scientific community can be leveraged more effectively, leading to faster breakthroughs and a more inclusive scientific environment. As we move forward, the focus should be on overcoming the technical and regulatory challenges while fostering a culture of open collaboration and innovation. With continued development and adoption, DeSci could very well redefine the ethos and methodologies of scientific research in the digital age.<\/p>\n\n\n\n<p>Contact Blaize to make up brand new blockchain-based solutions tailored for your project!<\/p>\n","protected":false},"excerpt":{"rendered":"<p>In an era defined by rapid technological advancements and an increasing demand for transparency and<a href=\"https:\/\/blaize.tech\/blog\/what-is-desci\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":342,"featured_media":60898,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[288],"tags":[312,440],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Unlocking the Future with DeSci: Explore Decentralized Science Now!<\/title>\n<meta name=\"description\" content=\"Discover how DeSci is transforming science! Dive into blockchain&#039;s role in fostering transparent, collaborative research. Click to learn more!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/blog\/what-is-desci\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Unlocking the Future with DeSci: Explore Decentralized Science Now!\" \/>\n<meta property=\"og:description\" content=\"Discover how DeSci is transforming science! Dive into blockchain&#039;s role in fostering transparent, collaborative research. Click to learn more!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/blog\/what-is-desci\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2024-06-07T14:53:12+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:09:46+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/Pictures-for-the-article-What-is-DeSci.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1200\" \/>\n\t<meta property=\"og:image:height\" content=\"628\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Sergey Onyshchenko\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@S_Onishchenko\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Sergey Onyshchenko\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/what-is-desci\/\",\"url\":\"https:\/\/blaize.tech\/blog\/what-is-desci\/\",\"name\":\"Unlocking the Future with DeSci: Explore Decentralized Science Now!\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2024-06-07T14:53:12+00:00\",\"dateModified\":\"2024-10-29T11:09:46+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\"},\"description\":\"Discover how DeSci is transforming science! Dive into blockchain's role in fostering transparent, collaborative research. Click to learn more!\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/blog\/what-is-desci\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/blog\/what-is-desci\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/blog\/what-is-desci\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"What is DeSci: The Revolution of Decentralized Science\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670\",\"name\":\"Sergey Onyshchenko\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png\",\"caption\":\"Sergey Onyshchenko\"},\"sameAs\":[\"https:\/\/www.linkedin.com\/in\/sergeyonishenko\/\",\"https:\/\/twitter.com\/S_Onishchenko\"]}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Unlocking the Future with DeSci: Explore Decentralized Science Now!","description":"Discover how DeSci is transforming science! Dive into blockchain's role in fostering transparent, collaborative research. Click to learn more!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/blog\/what-is-desci\/","og_locale":"en_US","og_type":"article","og_title":"Unlocking the Future with DeSci: Explore Decentralized Science Now!","og_description":"Discover how DeSci is transforming science! Dive into blockchain's role in fostering transparent, collaborative research. Click to learn more!","og_url":"https:\/\/blaize.tech\/blog\/what-is-desci\/","og_site_name":"Blaize","article_published_time":"2024-06-07T14:53:12+00:00","article_modified_time":"2024-10-29T11:09:46+00:00","og_image":[{"width":1200,"height":628,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2024\/06\/Pictures-for-the-article-What-is-DeSci.png","type":"image\/png"}],"author":"Sergey Onyshchenko","twitter_card":"summary_large_image","twitter_creator":"@S_Onishchenko","twitter_misc":{"Written by":"Sergey Onyshchenko","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/what-is-desci\/","url":"https:\/\/blaize.tech\/blog\/what-is-desci\/","name":"Unlocking the Future with DeSci: Explore Decentralized Science Now!","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2024-06-07T14:53:12+00:00","dateModified":"2024-10-29T11:09:46+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670"},"description":"Discover how DeSci is transforming science! Dive into blockchain's role in fostering transparent, collaborative research. Click to learn more!","breadcrumb":{"@id":"https:\/\/blaize.tech\/blog\/what-is-desci\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/blog\/what-is-desci\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/blog\/what-is-desci\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"What is DeSci: The Revolution of Decentralized Science"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/e98fbc01607fcb2fafa9bd7068749670","name":"Sergey Onyshchenko","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/sergey.png","caption":"Sergey Onyshchenko"},"sameAs":["https:\/\/www.linkedin.com\/in\/sergeyonishenko\/","https:\/\/twitter.com\/S_Onishchenko"]}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/60892"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/342"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=60892"}],"version-history":[{"count":5,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/60892\/revisions"}],"predecessor-version":[{"id":60903,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/60892\/revisions\/60903"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/60898"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=60892"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=60892"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=60892"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}