{"id":757,"date":"2020-03-20T09:20:07","date_gmt":"2020-03-20T09:20:07","guid":{"rendered":"http:\/\/7FB1632F-DF63-4639-B92C-46B18F560D74"},"modified":"2024-10-29T11:10:19","modified_gmt":"2024-10-29T11:10:19","slug":"blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology","status":"publish","type":"post","link":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/","title":{"rendered":"Using Blockchain for Healthcare: Major Opportunities &#038; Risks"},"content":{"rendered":"\n<p>Nowadays it’s not easy to find someone who hasn’t at least heard about Bitcoin and cryptocurrencies. Most of the people are also aware of blockchain (or distributed ledger technology – DLT), the technology that made cryptocurrencies possible in the first place.&nbsp;<br><\/p>\n\n\n\n<p>Only some actually knows that blockchain, as a game-changer technology, has a much wider potential application, and thus can revolutionize (or at least drastically improve) other industries and fields of human activity as well. The healthcare industry is one of them.&nbsp;<\/p>\n\n\n\n<p>What are blockchain risks and opportunities for healthcare? How does blockchain actually work in medicine? Are there any risks of using blockchain in healthcare? <a href=\"https:\/\/blaize.tech\/\"><strong>Blaize.tech<\/strong><\/a> experts will try to answer these are other vital questions right here.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\"><strong>Blockchain technology in healthcare<\/strong><\/h2>\n\n\n\n<ul class=\"navigation\"><li><a href=\"#Blockchain-in-Healthcare-Industry-and-Innovation\">Blockchain in Healthcare Industry and Innovation<\/a><\/li><li><a href=\"#Blockchain-and-Decentralization\">Blockchain and Decentralization<\/a><\/li><li><a href=\"#Public-vs.-Private-Blockchains\">Public vs. Private Blockchains<\/a><\/li><li><a href=\"#Blockchain-Opportunities-for-Healthcare\">Blockchain Opportunities for Healthcare<\/a><\/li><li><a href=\"#Blockchain-Risks-for-Healthcare\">Blockchain Risks for Healthcare<\/a><\/li><\/ul>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"Blockchain-in-Healthcare-Industry-and-Innovation\">Blockchain in Healthcare Industry and Innovation<\/h2>\n\n\n\n<p>200 healthcare executives<a href=\"https:\/\/www.ibm.com\/downloads\/cas\/BBRQK3WY\"> were surveyed by IBM Institute for Business Value<\/a> back in 2017, and 16% of them were expecting to have a commercial blockchain solution at scale already that year.&nbsp;<\/p>\n\n\n\n<p>Mass <a href=\"https:\/\/blaize.tech\/article-type\/blockchain-adoption-to-contact-center-industry-qubicles-use-case\/\">adoption of blockchain technology<\/a> in healthcare industry were expected to happen during 2018-2019 (according to 56% of the respondents), and 29% saw it coming in 2020.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img decoding=\"async\" src=\"https:\/\/lh3.googleusercontent.com\/AqyMvpFuxEQy6FAMXwkSIr-EYDeLbNj--bsYZGuWE708w3ItiWxtJ4T5A_cEghTJj1AF6uXuKETx1dhs_I-YLKDdlfmnUyyMhIpI1O6-X2Ua4MH5Vd-43mVWYLyp-d3zoOQ_0Kaf\" alt=\"\"\/><figcaption> <em>Source:<\/em><a href=\"https:\/\/www.ibm.com\/downloads\/cas\/BBRQK3WY\"><em> ‘Healthcare rallies for blockchains’ research by IBM Institute for Business Value.<\/em><\/a> <\/figcaption><\/figure><\/div>\n\n\n\n<p>Three years have passed since that survey but we still don’t see much progress actually going in that direction, while the expectation continues to rise.<\/p>\n\n\n\n<p>This, in fact, confirms the perception of the healthcare industry as one of the most conservative ones in terms of horizontal innovation (i.e. adopting cross-industry and humanity-wide innovations and technologies): even today most hospitals in the West (not to mention less developed regions and countries) still use paper files to process and store their records, including their patient-related data.<\/p>\n\n\n\n<p>As one can see, the healthcare industry could benefit even from far less <a href=\"https:\/\/blaize.tech\/article-type\/what-to-expect-blaize-predictions-of-blockchain-development-trends-in-2021\/\">innovative technologies than blockchain<\/a>, despite the risks of blockchain in healthcare. Meanwhile, blockchain clearly possesses the potential to stimulate innovation in various community-based healthcare models, including preventative care.<\/p>\n\n\n\n<p>Read Also: <strong><a href=\"https:\/\/blaize.tech\/article-type\/how-blockchain-and-ai-convergence-empowers-your-business\/\">AI and Blockchain<\/a><\/strong><\/p>\n\n\n\n<p>Due to its properties of cryptographic public-private access, immutability, and distributed data storage, DLT technology has the ability to guarantee an unparalleled level of health data integrity, while sharing it between different actors and parties. Thus, the implementation of blockchain can help to better integrate complex team-based healthcare, finance, and payment with the care provided. This could propel the trend of mutual integration and collaboration in the industry, which is extremely important for people’s health on a global scale.<\/p>\n\n\n\n<p>A blockchain-powered health data exchange can reveal the actual value of interoperability. The technology has the potential to connect currently siloed systems to generate more profound insights, as well as to better assess the value of care. It is the point where every participant of the healthcare ecosystem will greatly benefit. In the long term, a universal <a href=\"https:\/\/blaize.tech\/article-type\/how-to-choose-the-right-blockchain-network-for-your-dapp-development\/\">blockchain network<\/a> for electronic medical records may improve treatment efficiencies and provide better medical outcomes for patients.<\/p>\n\n\n\n<p>Plus, blockchain technology haPlus, blockchain technology in medicine has a significant potential to greatly simplify tracking of medicine movement along the supply chain, as well as towards the actual user (patient). This could lead to a crucial breakthrough in the war against drug counterfeiting, where pharmaceutical manufacturers bear annual damage that already nears $200 billion.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img decoding=\"async\" src=\"https:\/\/lh6.googleusercontent.com\/7_tIr2NVmqWSK_4K6g7OXWf_jpo2BdxjEEF33PqjnN4MBr027o6_7a9ndsSVamafEg9SKoHQYfQxO3MdIUo9AtLjsD3NAK9Ou5YTc5Yj_q7wEYdb8znea0_pKd00pypQnmvGRO2a\" alt=\"\"\/><figcaption> <em>Key counterfeit seizures by product type (number of items), 2013. <\/em> <br> <em>Source: <\/em>Outsmarting the Counterfeiters: The Importance of Brand Protection by SGS. <\/figcaption><\/figure><\/div>\n\n\n\n<p>In addition to better interoperability and security, blockchain also ensures better transparency and automation (thanks to <a href=\"https:\/\/blaize.tech\/article-type\/how-to-create-and-deploy-a-smart-contract-in-a-secure-way\/\">smart contracts creation<\/a>) for way more efficient processing of wide set of standardized and anonymous health data, as well as lead to lowering of administrative costs.<\/p>\n\n\n\n<p>One of the key benefits of blockchain innovation for the health industry also lays in the fact that this technology can be brought in gradually with a phased approach, rather than demanding an instant and total renovation of the whole system, and hence it is perfectly suited to the healthcare sector which is quite sensitive to things like that due to its vital importance.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"Blockchain-and-Decentralization\">Blockchain and Decentralization<\/h2>\n\n\n\n<p>The need for decentralization is one of the main reasons why distributed ledger technology (blockchain) has emerged in the first place. Bitcoin invention was the answer to the<a href=\"https:\/\/www.investopedia.com\/articles\/economics\/09\/financial-crisis-review.asp\"> global financial crisis of 2007-2008<\/a> that was the result of widespread abuse of trust by major banks and financial institutions.<\/p>\n\n\n\n<p>The problem was (and it still is) that the currently dominant financial system is trust-based – you have to trust your bank when you give it your money. As a result, banks and other financial institutions have accumulated too much control over society&#8217;s wealth in the form of financial resources. This concentration of power in the hands of a limited number of centralized human-operated institutions led to a temptation to abuse or at least misuse of the delegated public and\/or individual trust. And since the abuse has pumped up to the global scale it resulted in the global financial burst.<\/p>\n\n\n\n<p>So this taught humanity to re-evaluate trust in institutions and start finding alternative approaches, which in fact were quite obvious: trustlessness and decentralization.&nbsp;<\/p>\n\n\n\n<p>Blockchain became the ultimate technological answer to this challenge, as it incorporates both of the aforementioned approaches – it enables trustless transactions and decentralized storage of all curial information that a system contains. Ultimately, a blockchain is a distributed ledger that records transactions and tracks asset ownership.&nbsp; In blockchain data integrity and immutability of all time-stamped data blocks is guaranteed by a decentralized peer-to-peer network of computers, and not by a central authority. The result, one doesn’t need to have any trust in a centralized human-controlled body to perform all the needed operations. This makes blockchain a groundbreaking game-changing technology for the variety of sectors.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">How can healthcare benefit from decentralization?<\/h3>\n\n\n\n<p>In terms of health data we deal with a number of centralized bodies (hospitals and other health organizations) we have to trust our personal health-related data to. Those centralized bodies tend to become too possessive towards their patients’ data, since there are not much (if any) incentives to share it with other (competitive) organizations. Оn the contrary, there is a very strong incentive not to share it, so one can better bind one’s patients (in fact, one’s clients) to one’s own services. This is how the system works now.<\/p>\n\n\n\n<p>As a result, when we are talking about health data, we see the following (the list is not complete):<\/p>\n\n\n\n<ul><li>Lack of data standardization<\/li><li>Privacy and information security concerns and issues<\/li><li>Lack of interoperability between healthcare institutions<\/li><li>Lack of will (and in some cases – the very technical possibility) to release\/share patient’s information in the first place.<\/li><\/ul>\n\n\n\n<p>So, now we have a de-facto institution-centric system in terms of medical records. But instead we need to have a patient-centric one, since in the ideal system health information should be possessed, operated and controlled by data subjects other than hospitals alone.<\/p>\n\n\n\n<p>In other words, we need decentralization of medical data. And blockchain technology is here to help. It can not only provide relevant technical possibility, but also the needed commercial incentive to share, as it can create a universal health data market, where all players, including patients, could benefit.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"Public-vs.-Private-Blockchains\">Public vs. Private Blockchains<\/h2>\n\n\n\n<p>But not every blockchain kind is equally good for healthcare use case. And there are two kinds of blockchains in terms of accessibility type, namely public and private.<\/p>\n\n\n\n<p>Basically, these two blockchain types could share all the same characteristics and features, except for one big difference: who can participate in the system.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Public Blockchains<\/h3>\n\n\n\n<p>These are blockchains as most of us know, like Bitcoin, Ethereum or almost any other prominent or less-known cryptocurrency. Naturally, those are public or permissionless blockchains, meaning that anyone with the right gear and motivation is free to join as virtually any ecosystem role – be it full node, miner, validator etc. And this is great for some applications like alternative banking or currency system.&nbsp;<\/p>\n\n\n\n<p>But it’s not that great for healthcare institutions, since there is no practical need for <em>anyone<\/em> to participate in a system like the one that deals with personal medical records and other sensitive health-related information. Unlike currency use case, where anyone should be able to initiate a transaction, in healthcare medical records are created exclusively by hospitals and\/or doctors, and only specific users should be able to manipulate and access this data.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Private Blockchains<\/h3>\n\n\n\n<p>Private blockchains instead are permissioned systems. Yes, they still are decentralized in a way that no party has exclusive control over such a blockchain. And yet in order to participate, one has to get special permission and\/or approval.<\/p>\n\n\n\n<p>That permission could be granted by a state regulator, other participants, special collective governing body (association, consortium) or otherwise. The main idea is to find the right balance between decentralization and a situation when only relevant participants can maintain and access to the system.<\/p>\n\n\n\n<p>Obviously, private or permissioned blockchains are the right choice for the healthcare use case for the reasons mentioned above.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"Blockchain-Opportunities-for-Healthcare\">Blockchain Opportunities for Healthcare<\/h2>\n\n\n\n<p>Next, consider the blockchain risks and opportunities. The healthcare industry (and its clients – the patients, of course) can benefit from the blockchain technological innovation in a number of fields, namely:<\/p>\n\n\n\n<ul><li>In healthcare itself<\/li><li>In supply chain management of the pharmaceutical industry<\/li><li>In medical research<\/li><li>In medical insurance anti-fraud efforts.&nbsp;<\/li><\/ul>\n\n\n\n<p>Above we already briefly described several main benefits that healthcare itself and pharmaceutical industry can draw from blockchain technology implementation, like better interoperability between medical institutions, better sharing between healthcare providers which leads to higher probability of more accurate diagnoses, resulting in more efficient patient treatment. Also this can improve cost-effectiveness of healthcare services.<\/p>\n\n\n\n<p>Blockchain’s ability to deliver unparalleled information security and data integrity, as well as trackability of medical records, the ability to identify its source and all modifications including their validity, provides another great advantage of this innovation.&nbsp;<\/p>\n\n\n\n<p>Also, data subjects (patients in this case) will exercise more control over their own personal medical data. For instance, they will have some control over how their health data is used and shared by hospitals and other relevant ecosystem actors.<\/p>\n\n\n\n<p>Additionally, medical and healthcare research institutions could incentivize patients to allow full or partial access to their medical data for research purposes and conducting clinical trials. This could stimulate the creation of a whole new blockchain healthcare market as well.&nbsp;<\/p>\n\n\n\n<p>Another extremely important application of blockchain innovation could be anti-fraud efforts in healthcare insurance. The problem is huge. In the US alone $60 billion was lost to fraud in 2017,<a href=\"https:\/\/www.aarp.org\/money\/scams-fraud\/info-2018\/medicare-scams-fraud-identity-theft.html\"> according to AARP<\/a>, that exceeds most of the national programs like homeland security, NIH-sponsored medical research, NASA programs, etc.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter size-full\"><img loading=\"lazy\" decoding=\"async\" width=\"1140\" height=\"655\" src=\"https:\/\/blaize.tech\/wp-content\/uploads\/2022\/07\/xD_7Z1tQrZPqu6oz1ZaBFit6X6KnmmCV6aoIiqO56kz7BaGjfJkYTkQKJxjcPcwBSu4JcY-2kdThzPpSAF2Tx51dE5J2JDQGzBOQkb-Kw0oS4wHnPmRdmlUCcV1fOTj3Edda_dUZ.jpg\" alt=\"\" class=\"wp-image-7960\"\/><figcaption> $60 billion was lost to fraud in the US in 2017. Image source:<a href=\"https:\/\/www.aarp.org\/\"> AARP<\/a>. <\/figcaption><\/figure><\/div>\n\n\n\n<p><a href=\"https:\/\/www.hks.harvard.edu\/faculty\/malcolm-sparrow\">Malcolm Sparrow<\/a>, a Harvard University professor and leading expert on health care fraud, says that fraudsters often:<\/p>\n\n\n\n<ul><li>Charge for services never delivered<\/li><li>Falsify records<\/li><li>Inflate claims<\/li><li>Steal one’s medical ID<\/li><li>File duplicate claims<\/li><li>Provide unneeded equipment<\/li><li>Buy off doctors\/patients.<\/li><\/ul>\n\n\n\n<p>Implementation of blockchain technology in healthcare can really make a difference in this field since, as we can see, most of the medical insurance fraud is related to illegal data manipulation.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\" id=\"Blockchain-Risks-for-Healthcare\">Blockchain Risks for Healthcare<\/h2>\n\n\n\n<p>The biggest concerns about implementing blockchain in healthcare are some well-known technological limitations and features of classical public blockchains:<\/p>\n\n\n\n<ul><li>Speed and scalability<\/li><li>Overall transparency and lack of confidentiality<\/li><li>Theoretical possibility of<a href=\"https:\/\/www.investopedia.com\/terms\/1\/51-attack.asp\"> 51% attack<\/a>.<\/li><\/ul>\n\n\n\n<p>As health data could accumulate to a huge amount of transactions, plus speed of information exchange in healthcare is often literally a matter of life and death, the scalability issue is of one of the greatest concerns.&nbsp;<\/p>\n\n\n\n<p>However, this could be addressed by implementation of private blockchains (see above) where transaction speed could be improved and better controlled.<\/p>\n\n\n\n<p>Same goes for the second and third concerns – confidentiality and 51% attack possibility. Private blockchains can quite effectively address these issues as well.<\/p>\n\n\n\n<p>Also, one should also be aware that blockchain technology in medicine is still developing and constantly improving rather than a fixed and completed one. There are more than one <a href=\"https:\/\/blaize.tech\/for-enterprises\/\">enterprise blockchain solution<\/a> to most of these issues already in development or at practical implementation stages.&nbsp;<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Conclusion<\/h3>\n\n\n\n<p>Global healthcare industry experience constant growth. In 2016, the<a href=\"https:\/\/apps.who.int\/iris\/rest\/bitstreams\/1165184\/retrieve\"> world spent US$ 7.5 trillion on health<\/a>. Moreover,<a href=\"https:\/\/www.oecd.org\/health\/health-spending-set-to-outpace-gdp-growth-to-2030.htm\"> health spendings are expected to outpace GDP growth to 2030<\/a>. At the same time, digital health startup funding<a href=\"https:\/\/www.beckershospitalreview.com\/healthcare-information-technology\/digital-health-startup-funding-peaked-at-5-1b-in-1h-2019-report-finds.html\"> peaked to an all time high at $5.1B in the first half of 2019<\/a>.<\/p>\n\n\n\n<div class=\"wp-block-image\"><figure class=\"aligncenter\"><img decoding=\"async\" src=\"https:\/\/lh5.googleusercontent.com\/255CIvjJPj22EO1vdSHbPRBa9mOneV0iM8Dd9W1V2dAxOlqFMMKsUqC8Ym54T5q-RqAJ55onlTH7029VaRcEO-snk4e9gMnR3YXZo32_0uP0bCst1y81m_wDvXpDIFEFiC0ShQJB\" alt=\"\"\/><figcaption> <em>Image source:<\/em><a href=\"https:\/\/www.oecd.org\/\"><em> OECD<\/em><\/a><em>.<\/em><\/figcaption><\/figure><\/div>\n\n\n\n<p>These facts provide solid confidence that there will be more than enough resources available for IT-related improvements in the industry.<\/p>\n\n\n\n<p>A number of other industries are already experimenting with or implementing blockchain innovation. And healthcare could well be one of the ultimate natural use cases for DLT, as we shown above.<\/p>\n\n\n\n<p>However, there are a number of technical issues that should be addressed and choices that should be made in the process. For this technological upgrade it is crucial to pick the right experts and specialists to work with. The once that have the right expertise and understand your projects’ specifics and challenges.<br>Whether it is a medical <a href=\"https:\/\/blaize.tech\/for-startups\/\">startup<\/a> or a well established healthcare provider,<a href=\"https:\/\/blaize.tech\/\"> <strong>Blaize.tech<\/strong><\/a> is always here to help. <\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Frequently Asked Questions<\/h2>\n\n\n\n<p><strong>Is blockchain the future of healthcare?<\/strong><\/p>\n\n\n\n<p>Blockchain technology can transform many industries, including healthcare. When it comes to the medical field, it can benefit many branches, including healthcare itself, supply chain management of the pharmaceutical industry, medical research, and medical insurance when it comes to anti-fraud measures.<\/p>\n\n\n\n<p><strong>Which countries use blockchain in healthcare?<\/strong><\/p>\n\n\n\n<p>At the moment, there are several countries, including Estonia and Malta, that use blockchain technology in healthcare. However, we can predict a much higher level of adoption in the future, which will influence international medical companies and country-specific healthcare services.<\/p>\n\n\n\n<p><strong>How is blockchain changing the healthcare industry?<\/strong><\/p>\n\n\n\n<p>There are many use cases of the blockchain technology in healthcare. Here are a few examples:<\/p>\n\n\n\n<ul><li>Patient data management<\/li><li>Data encryption<\/li><li>Healthcare transactions control<\/li><li>Supply chain management in the pharmaceutical industry<\/li><li>Clinical trials and healthcare research improvement<\/li><li>Paperwork management<\/li><\/ul>\n\n\n\n<p><strong>How could blockchain help lower health costs?<\/strong><\/p>\n\n\n\n<p>Blockchain can remove all the unnecessary intermediaries and verifications, thus simplifying the process of medical billing and cutting costs. Besides, it eliminates paperwork, which results to faster processes, easier management, and lower prices.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Nowadays it’s not easy to find someone who hasn’t at least heard about Bitcoin and<a href=\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\" class=\"more-link\"><strong> &#8230; Read More<\/strong><\/a><\/p>\n","protected":false},"author":358,"featured_media":740,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"inline_featured_image":false,"footnotes":""},"categories":[285,284,288,278],"tags":[312,330],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v21.9.1 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Blockchain in Healthcare: Opportunities and Risks<\/title>\n<meta name=\"description\" content=\"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Blockchain in Healthcare: Opportunities and Risks\" \/>\n<meta property=\"og:description\" content=\"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry\" \/>\n<meta property=\"og:url\" content=\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\" \/>\n<meta property=\"og:site_name\" content=\"Blaize\" \/>\n<meta property=\"article:published_time\" content=\"2020-03-20T09:20:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-29T11:10:19+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/03\/Blockchain-in-Healthcare.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"990\" \/>\n\t<meta property=\"og:image:height\" content=\"570\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Maxim Shcherbina\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Maxim Shcherbina\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebPage\",\"@id\":\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\",\"url\":\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\",\"name\":\"Blockchain in Healthcare: Opportunities and Risks\",\"isPartOf\":{\"@id\":\"https:\/\/blaize.tech\/#website\"},\"datePublished\":\"2020-03-20T09:20:07+00:00\",\"dateModified\":\"2024-10-29T11:10:19+00:00\",\"author\":{\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829\"},\"description\":\"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry\",\"breadcrumb\":{\"@id\":\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/blaize.tech\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Using Blockchain for Healthcare: Major Opportunities &#038; Risks\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/blaize.tech\/#website\",\"url\":\"https:\/\/blaize.tech\/\",\"name\":\"Blaize\",\"description\":\"Know the rules, create new ones\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/blaize.tech\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Person\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829\",\"name\":\"Maxim Shcherbina\",\"image\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/blaize.tech\/#\/schema\/person\/image\/\",\"url\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png\",\"contentUrl\":\"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png\",\"caption\":\"Maxim Shcherbina\"}}]}<\/script>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Blockchain in Healthcare: Opportunities and Risks","description":"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/","og_locale":"en_US","og_type":"article","og_title":"Blockchain in Healthcare: Opportunities and Risks","og_description":"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry","og_url":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/","og_site_name":"Blaize","article_published_time":"2020-03-20T09:20:07+00:00","article_modified_time":"2024-10-29T11:10:19+00:00","og_image":[{"width":990,"height":570,"url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/03\/Blockchain-in-Healthcare.jpg","type":"image\/jpeg"}],"author":"Maxim Shcherbina","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Maxim Shcherbina","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebPage","@id":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/","url":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/","name":"Blockchain in Healthcare: Opportunities and Risks","isPartOf":{"@id":"https:\/\/blaize.tech\/#website"},"datePublished":"2020-03-20T09:20:07+00:00","dateModified":"2024-10-29T11:10:19+00:00","author":{"@id":"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829"},"description":"Most people are aware of blockchain and crypto, yet technology has a much wider potential to revolutionize the healthcare industry","breadcrumb":{"@id":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/blaize.tech\/blog\/blockchain-in-healthcare-opportunities-and-risks-of-using-blockchain-technology\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/blaize.tech\/"},{"@type":"ListItem","position":2,"name":"Using Blockchain for Healthcare: Major Opportunities &#038; Risks"}]},{"@type":"WebSite","@id":"https:\/\/blaize.tech\/#website","url":"https:\/\/blaize.tech\/","name":"Blaize","description":"Know the rules, create new ones","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/blaize.tech\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Person","@id":"https:\/\/blaize.tech\/#\/schema\/person\/bb7a1137ca30d15b15719f91170db829","name":"Maxim Shcherbina","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/blaize.tech\/#\/schema\/person\/image\/","url":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png","contentUrl":"https:\/\/blaize.tech\/wp-content\/uploads\/2020\/04\/max.png","caption":"Maxim Shcherbina"}}]}},"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/757"}],"collection":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/users\/358"}],"replies":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/comments?post=757"}],"version-history":[{"count":27,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/757\/revisions"}],"predecessor-version":[{"id":33180,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/posts\/757\/revisions\/33180"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media\/740"}],"wp:attachment":[{"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/media?parent=757"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/categories?post=757"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/blaize.tech\/wp-json\/wp\/v2\/tags?post=757"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}